{"meta":{"title":"EASON+","subtitle":"","description":"","author":"EASON+","url":"https://www.easonx.cn","root":"/"},"pages":[{"title":"关于","date":"2020-07-08T11:18:26.513Z","updated":"2020-07-08T11:18:26.513Z","comments":true,"path":"about/index.html","permalink":"https://www.easonx.cn/about/index.html","excerpt":"","text":"Eason+"},{"title":"所有分类","date":"2020-07-06T06:24:19.363Z","updated":"2020-07-06T06:24:19.363Z","comments":true,"path":"categories/index.html","permalink":"https://www.easonx.cn/categories/index.html","excerpt":"","text":""},{"title":"所有标签","date":"2020-07-06T06:24:40.700Z","updated":"2020-07-06T06:24:40.700Z","comments":true,"path":"tags/index.html","permalink":"https://www.easonx.cn/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"吃烤串","slug":"eat-bbq","date":"2020-07-09T16:00:00.000Z","updated":"2020-07-10T05:50:35.235Z","comments":true,"path":"2020/07/10/eat-bbq/","link":"","permalink":"https://www.easonx.cn/2020/07/10/eat-bbq/","excerpt":"昨天打坐效果不是特别好，只坐了2个小时。修行就是这样，偶尔有惊喜，大部分时间没有进步、平平无奇。晚上本想着在外面随便吃点，在富荟广场逛着逛着，发现新开了一个店，叫三个蒙古大叔烤羊肉串，进去吃了顿饭。","text":"昨天打坐效果不是特别好，只坐了2个小时。修行就是这样，偶尔有惊喜，大部分时间没有进步、平平无奇。晚上本想着在外面随便吃点，在富荟广场逛着逛着，发现新开了一个店，叫三个蒙古大叔烤羊肉串，进去吃了顿饭。 店内有很多屏幕，都应该是LED超薄屏吧，离我最近屏幕的图案是白云和不断飘落的花瓣。让我想到了《西部世界》第三部，地铁里那个有红鲤鱼游动的屏幕。 吃烤串有专门的架子，架子的宽度比烤串长度短一些，在接近烤串两端的位置各有十几个齿轮，可以360度转动，这样就不用人工来翻转烤串了，是一个聪明的发明。 关于吃肉和佛教，上座部一直的传承是，佛陀从来没有说不能吃肉，实际上出家人托钵，是接受在家居士供养的包括荤菜之内所有食物的，不挑剔。在家的修行者，需要注意至少要持五戒，而且吃食物时尽量少升起贪根心，保持打坐周围环境的整洁舒适，这样打坐的时候容易升起轻安。 最近一直在听uttama尊者的云禅修营的开示，好像尊者是在多伦多，到今天快结束的时候蹦出一两句搞笑的话。意思是说如果你工作非常忙碌，是很难升起正念正知的，如果不是太缺钱，这个家庭不是太困难，你为什么要干的那么辛苦呢？伟大的五蕴狗:)。 尊者的开示也不都是严肃刻板，也有风趣幽默，这也是心灵升华到一定程度自然产生的。希望自己能成为类似的人，不为外物所缚，即使失去很多，也能保持快乐的心境:)。","categories":[{"name":"daily","slug":"daily","permalink":"https://www.easonx.cn/categories/daily/"}],"tags":[{"name":"富荟广场","slug":"富荟广场","permalink":"https://www.easonx.cn/tags/%E5%AF%8C%E8%8D%9F%E5%B9%BF%E5%9C%BA/"},{"name":"西部世界","slug":"西部世界","permalink":"https://www.easonx.cn/tags/%E8%A5%BF%E9%83%A8%E4%B8%96%E7%95%8C/"},{"name":"餐厅","slug":"餐厅","permalink":"https://www.easonx.cn/tags/%E9%A4%90%E5%8E%85/"},{"name":"烧烤","slug":"烧烤","permalink":"https://www.easonx.cn/tags/%E7%83%A7%E7%83%A4/"}]},{"title":"禅修总结(壹)","slug":"meditation-summary1","date":"2020-07-08T07:00:00.000Z","updated":"2020-07-09T08:17:36.643Z","comments":true,"path":"2020/07/08/meditation-summary1/","link":"","permalink":"https://www.easonx.cn/2020/07/08/meditation-summary1/","excerpt":"最近博主修习止禅出现了一些进展，这些进展不是突然出现的灵感，而是阅读了很多导师的文章，用其指导禅修之后产生的。","text":"最近博主修习止禅出现了一些进展，这些进展不是突然出现的灵感，而是阅读了很多导师的文章，用其指导禅修之后产生的。 如果内心想要去除纷乱的想法和焦虑感，修习止禅是最好选择，现代科技发达，很多劳动者的思想都比较复杂，容易妄念纷飞，追悔过去。 我们每天使用心去思虑，心会带着一些不好的习惯，影响我们的言行。这样的心在阿毗达摩里包括掉举和追悔两种不善心所。 把心灵调校正确，能给我们的工作和生活带来很多利益。 这里推荐下坦尼沙罗尊者的开示 呼吸禅定步骤 和 阿姜布拉姆的开示 禅悦：快乐呼吸十六法 两篇文章都详细描述了修习禅定中的细微之处，阅读他们的开示能体会到智慧和善巧之处。 《中部》的《入出息念经》所提到的十六步，也出现在上座部佛教的著作《清净道论》中。佛陀为我们总结了清晰的步骤，只要按照这十六个步骤一步步来修习，一定会有所收获。修习需要循序渐进，不要指望跳过前期的步骤而进入后期，想快速进入某个步骤，也要以前期的步骤为基础。博主之前就是没有了解到这么细致，只是关注鼻尖下的呼吸，而没有注意过程中升起的喜和乐，导致禅修没有什么进展。 从博主的体验来看，经历过了第三步，体验到完整的呼吸，第四步自然会将注意力全部导向呼吸，而注意力集中的结果，是五根门对外界觉知的减弱，进而加强意识对呼吸的念住和觉知，比较理想的状态是身体的感觉几乎没有，只有意门在觉知呼吸。第五和第六步非常关键，只有自然升起喜和乐，才代表你前面四步做的不错，此时你需要继续觉知平稳的呼吸，并且不能沾沾自喜，这样后面第七步和第八步才有可能顺利到来。如果在关键步骤过于兴奋和激动，那么你会破坏自己稳定的状态，心会从呼吸的所缘上跑开，你需要重新聚集心力，持守呼吸，注入足够的专注力，才能重新回到关键步骤。实际修习中，很多人达到念息遍身（体验完整的呼吸）和除身（使呼吸平稳）这两步就已经很难，从他们打坐的外形来看，面部表情痛苦，昏昏欲睡，说明完全没有进入觉喜与觉乐的第五和第六步。即使进入了第五和第六步，喜乐感的强弱也会有波动，完全看你当时内心的素质。 在第六步之后更难的是，升起喜乐并保持，同时需要平稳平静的觉知呼吸。心的力量不仅要维持喜乐的存在，并且要维持对于呼吸业处的关注力。第七步是觉心行，博主认为和第四步–使呼吸平稳 相呼应，只有平稳的呼吸才能带来对呼吸用心的感受，内心喜乐感的减弱，会使我们重新回到第四步，着重展开稳定呼吸的工作。而喜乐感的增加，呼吸会变的极其微细，让你越来越趋向第七步–觉心行。当你第七步做的很好时，呼吸会逐渐“消失”，因为喜和乐已经非常明显，我们的心有一部分在体验这种喜乐，注意不要因为喜乐打破了内心的静默。入出息念的所缘仍然是呼吸，注意不要丢失对呼吸的觉知。这些步骤互相依存、缺一不可，每一步都在描述修习禅定的要素。","categories":[{"name":"tradition","slug":"tradition","permalink":"https://www.easonx.cn/categories/tradition/"}],"tags":[{"name":"佛法","slug":"佛法","permalink":"https://www.easonx.cn/tags/%E4%BD%9B%E6%B3%95/"},{"name":"止禅","slug":"止禅","permalink":"https://www.easonx.cn/tags/%E6%AD%A2%E7%A6%85/"},{"name":"阿毗达摩","slug":"阿毗达摩","permalink":"https://www.easonx.cn/tags/%E9%98%BF%E6%AF%97%E8%BE%BE%E6%91%A9/"}]},{"title":"【转】连载六：禅悦：快乐呼吸十六法","slug":"the-16-steps-of-happy-breath","date":"2020-07-06T16:00:00.000Z","updated":"2020-07-08T11:05:56.858Z","comments":true,"path":"2020/07/07/the-16-steps-of-happy-breath/","link":"","permalink":"https://www.easonx.cn/2020/07/07/the-16-steps-of-happy-breath/","excerpt":"[作者]阿姜布拉姆 第四章 美丽的呼吸​ 佛教的精髓在佛陀的觉悟中。有一次，在佛陀修行面临困难时，他忆起童年时一次禅修的经验，明了禅那乃是通向正觉之道。于是他坐在菩提树下开始禅修，所使用的方法旧时入出息念。这样修习进出禅那，他迅速获得正觉正见，因而成为了觉悟者。","text":"[作者]阿姜布拉姆 第四章 美丽的呼吸​ 佛教的精髓在佛陀的觉悟中。有一次，在佛陀修行面临困难时，他忆起童年时一次禅修的经验，明了禅那乃是通向正觉之道。于是他坐在菩提树下开始禅修，所使用的方法旧时入出息念。这样修习进出禅那，他迅速获得正觉正见，因而成为了觉悟者。 入出息念也是随后佛陀教导弟子们禅修的重要方法，在藏经中，尤以《中部》的《入出息念经》最为著名。 入出息念包含前期准备意即接下来的十六个步骤。前十二个是之道如何进入禅那，后四个是关于推出禅那后该如何行事的指导。 前期准备寻找安静的场所 首先，佛陀说要找一个不会受到人、声音或琐事（如蚊子叮咬）打扰的安静处。虽然有人可能想要在蚊虫肆虐的丛林或老虎出没的步道上禅修，但那只会增长禅修者的忍耐力而非进入禅那的能力。佛陀称赞的理想场所是像公园或果园一类的地方。 接着，找个舒适的座位坐下来。你可以坐在垫子、板凳或椅子上，只要能让身体轻松的久坐即可。你也不必要盘起双腿并僵硬的挺直后背，用最随意的姿势进行禅修就好。不管选择何种姿势，目的只在于解除不适并尽快放松身体。入出息念的十六个步骤最好用坐姿完成，正如佛陀在菩提树下做的一样。 安立正念接着，你需要系念在前。意思并非把注意力放在鼻尖＼上嘴唇或眼前的某处，而是指重拾正念，也就是说，禅修者要先安立正念。 在前期准备工作中，我们当遵循修习觉知当下与静默觉知当下的方法创立正念，也就是保持静默，将正念集中于当下正发生的事情——这种层次的正念正是你开始修习入出息念时所需要的。 有太多的禅修者太快进入呼吸的禅修阶段，忽略了要先建立足够的正念的前期指导，因此而遇到麻烦，他们无法将呼吸持守于心，甚至用太多的意志力顽强的抓住呼吸，以致越来越紧张，也使佛教的呼吸禅法背上污名。 呼吸禅法十六步步骤一、二：知息入和知息出虽然佛陀说须先体验绵长的呼吸，后再体验短促的呼吸，但你无需强自控制呼吸以符合这项教导。企图控制呼吸只会导致不适，你只要单纯观察呼吸，觉知它的长短即可。我们需要了解这项教导的原因是，开始时你可能会觉得只是观察吸气和呼气感觉很无趣，但佛陀的教导会帮助你了解更多。有时我会建议弟子应在此阶段注意：入息与出息，谁持续的时间较长？入息与下一个出息之间的间隔，是否和出息与随后入息之间的间隔一样长？入息的感觉和出息的感觉相同吗？其作用跟佛陀教导的体验长短呼吸是相同的，目的是让禅修者观察更多细节，不致生厌。 还有一个方法可以帮助你持守呼吸，设想一个有关入息与出息的美丽故事。我提醒弟子，我们正吸进的氧气是花园和森林中的植物补给的，而呼出的二氧化碳则是植物的食物。因此，可以想象自己正在吸入花朵与树木所赐予的珍贵礼物，而呼出的空气同样是送给身边绿色植物的宝贵礼物——你的呼吸与生气勃勃的植物紧密关联，这种感知呼吸的鲜活方式，会让你更容易持守呼吸。 在泰国森林传统中，佛陀二字被融入了呼吸的禅修之中，吸气时末年佛，吐气时，默念陀，起作用同样是让你在禅修的初期阶段更容易持守呼吸。 步骤三：念息遍身（体验完整的呼吸）第三步意思为体验完整的呼吸过程，某些人会误解“身”指身体，因此错误的以为此阶段应把注意力转向全身所有感觉，这是个错误。实际上，第三个步骤的目的是为了让禅修者可以更加熟练的运用、维持正念，去观察呼吸过程中产生的每一个感觉。 依循此步骤，你可以清楚的觉知入息从原本静止到开始启动的整个过程，你能看见入息每一刹那的进展，其达到定点后逐渐消退，直到完全消失，你的内心甚至清明到可以看见空隙，入息与下一个出息之间的间隙。你的心要像猫捉老鼠一样保持警觉，以捕捉下一个出息的启动。 随后，你观察着出息逐步进展的过程——开始启动，达到定点而后消退，最后再次消失。接着，你要观察出息与入息之间短暂停歇的空隙。在这重复呼吸的过程中，你便已经完成了第三步，体验完整的呼吸。 在印度的经典史诗摩诃婆罗多中有一个譬喻，关于一个老师和三位弟子的故事，可以用来解释第三个步骤。意为老师以射箭训练弟子禅修，一段时间后，老师把一个玩具鸟小心安放在很远的树枝上，要求他们必须射穿鸟的左眼。老师告诉他们，必须先安静，让心与目标合一，才能放箭。第一个弟子射出前，老师问，能看见鸟嘛？他毫不犹豫的回答，是的。老师马上把他推开。第二个弟子射出前，老师问，能看见树上的鸟吗？弟子说，什么树。老师继续问，能看见鸟吗？弟子说，是的。老师继续推开他。第三个弟子射出前，老师问，你能看见树上的鸟吗？，他答道，什么树？什么鸟？老师继续问，那你看见什么？弟子说，我只看到一个眼球。——箭笔直的射穿了弟子觉知到的唯一事物，鸟的左眼。 这个故事对于如何达到入出息念的第三步——体验完整的呼吸，是个相当精准的比喻。就像第三个学生全心专注于鸟的左眼，你同样也应该专注于体验完整的呼吸。当你完成第三步时，若问你，你能听到声音吗？你会答，什么声音？你能感觉到身体吗？什么身体？你能看见什么？只有当下的呼吸。很好！ 步骤四：除身（使呼吸平稳）当你完全专注于呼吸时，妨碍你进步的因素锐减，你的呼吸自然会变得安定平稳，轻柔平顺，就如同一块粗重的厚棉布换成了细致的绸缎。你可以暂时打破内在的静默，对自己重复说，平稳、平稳，以确保整个过程顺利进行，然后再重新回到静默之中，体验唯有呼吸的当下。你还可以通过这么做来给守门人指示。 如果你太快跳入第四步，将会陷入昏眠，只有先捉住野马，才有可能驯服它。同样，你必须先捕捉到完整的呼吸，第三步完成后，才能使呼吸变得平稳。凭借意志力达到第三步的禅修者，会发现自己无法调和呼吸，使其安定平稳。他们过去只是用力而未放下，因此现在才会停滞不前。当你手上拿着一朵花时，绝不可握得太紧，否则只会弄坏它。精细的对象需要细腻的接触，如果想要维持正念，持续数分钟的觉知平稳的呼吸，你的心就要非常敏锐，它永远无法只凭借纯粹的意志力去强行掌控。 当木匠锯木材时，他可以看见整把锯子，当他专注于锯木时，他的注意力会越来越集中于锯子接触木材的那一部分，锯柄很快便从眼前消失，再过一会，他就只能看见与木材接触的那个锯齿，左右两边的锯齿都不在他的觉知范围内，他不知道也无需知道那锯齿到底属于锯子的前段中段还是后段。 同样，第四步中，当呼吸逐渐平稳，你的注意力将变得非常精细，你只会觉知到当下那一刹那的呼吸。你完全不知道它是入息还是出息。 步骤五、六 觉喜与觉乐（体验伴随呼吸而来的喜与乐）第五步，你将体验伴随呼吸而来的喜，第六步则将体验伴随呼吸而来的乐。喜与乐很难被拆开，且经常一起出现，因此我们可将二者视为一体。 当呼吸逐渐平稳时，喜与乐会自然生起，就如黎明的太阳光在东方地平线上缓缓出现一般。因为此时你所有的心理能量都流入了觉知者而非造作者，所以喜与乐是自动生起，而非由你控制。事实上，从你呼吸的平稳程度可知，你什么也没做，只是在观察。清晨第一道阳光照在地平线上只是早晚的问题，同样，当你维持平稳的呼吸时，喜与乐也迟早会出现在你的心中。 倘若你已经达到第四步，且能持续觉知非常平稳的呼吸，却未看到喜与了，那么我给你的忠告是，别惊慌，别因失去耐心而破坏了整个进程。你可以这样反省，你是完全静默的觉知呼吸吗？你可有受到什么干扰？也许是因为你未能持续觉知当下的呼吸，也可能是你的呼吸还不够平稳。若果真如此，请耐心等候，当你能够维持正念，不受任何干扰的觉知呼吸，且呼吸变得越来越平稳时，喜与乐迟早会生起。 伴随呼吸而来的喜与了开始时可能极其微妙，使你难以察觉，就如某个常吃便宜餐点的人，首次去五星级的法国餐厅，因为品位太差而不懂得欣赏那里的菜肴。当你的禅修经验越来越丰富时，你将能很快觉知喜与乐，成为静心的行家。 完成入出息念的第五与第六步，等同于达到前面介绍的基本禅法中“持续专注的觉知美丽的呼吸。在此阶段，呼吸回显得非常平静和美丽，甚至比春天的花园或夏天的日落更迷人。 步骤七，觉心行（用心体验呼吸）当呼吸变得更加美丽，喜与乐在无形中逐渐增长时，你的呼吸似乎完全消失了。在第一章中，我称此为只剩下美丽的呼吸。我也举了嘻笑猫为例。这精确的描述了以下过程，从第五与第六步进入第七步时，只认知到呼吸需用心体验，换言之，此时呼吸遁于无形，你只能用心去感受。 在此我要引用佛陀对于眼耳鼻舌身意六根的分析，来理清上述转变过程。在禅修初期，你舍弃眼耳鼻舌，让这四根暂时完全关闭，然后舍弃第五根身的多数活动，而只专注于呼吸的触感，并排除其他所有的事物。第六根，意，则自始至终都在运作。现在，第五根身也关闭了，只剩下第六根意在觉知呼吸。请想象某位老朋友，满头乱发，蓄着胡子，经常穿的邋遢的到处走动，后来他出家为僧，当你初次在寺院见到他时，他光着头，还穿着僧袍，你可能认不出他，但他毕竟还是你的老朋友，只是衣着外表不同罢了。 同样，你的老朋友呼吸常常穿着触感走来走去，对此你主要是用过第五根来认知的，在入出息念的第七个步骤里，你的呼吸超越了五根的世界（尤其是第五根），现在你只是通过第六根，而认知到呼吸是心的体验对象。这正是佛陀称这一步为觉心行的原因。 因此，若你的呼吸在此阶段似乎消失了，切记这是自然现象，别四处寻找从前对呼吸的感知。当呼吸似乎消失时，你应问自己还剩下什么，若你已认真的遵从直到，在喜乐安立之后，呼吸只会看似消失，剩下的只有喜与乐。你的正念必须细微到足以辨认出喜与乐这个微妙的对象，它将会告诉你这微妙的喜与乐旧时老朋友呼吸，但现在你只能用心去体验。 若无法持守呼吸，那是因为自第五步与第六步生起的喜乐还不够，在关闭第五根前，你应该积极禅修，在感受到大量的喜与乐之后，才会观察到较美丽的呼吸。不过只要多练习，正念会更灵巧的持守微妙的喜乐层次，你也能早一点舍弃第五根，用意根（心）去体验呼吸。 步骤八：除心行（保持呼吸的平稳）在禅修的这一阶段与后续阶段，积累的喜与乐可能会使你过于兴奋而不再平静。因此佛陀才会教导入出息念的第八步，保持呼吸的平稳。 当禅修初学者（有时也可能是经验丰富者）在开始经历一些禅悦时，他们一不小心就会产生“哇”的反应，哇，终于出现了，太惊人了！但这时禅悦会立即消失，因为他们太兴奋了。 恐惧也可能会随着禅悦生起，这不是我所能承受的，这太惊人了，我不该得到。于是禅悦再次消失了，因为恐惧破坏了平静。 因此，要当心兴奋与恐惧这两个敌人，人啊们可能在此阶段出现，这时你要记得让呼吸保持平稳，并维持当下的安定与静默，否则禅悦将会消失。 阿姜查的著名比喻“宁静的森林水池”有助于我们了解此处的情况。阿姜查在泰国的丛林中修习头陀行时，常因炎热而汗流浃背，如果下午没有洗澡，整个晚上都会因粘腻而感到不适。因此他往往会寻找森林中的水塘，在附近扎营过夜。 处理完其他事物后，他会在离水塘几米处禅坐。他有时习惯睁开眼睛打坐，因此会看见许多动物走出丛林来洗澡、喝水。他们只有在非常平静的时候才会出来。他们走出灌木丛，会四处张望和嗅闻，以查看是否安全。如果他非常平静，动物就会出来，有些还在水中玩耍，好像他不存在。有时也会出现一些罕见的不知名的动物。 这个比喻很适合用于描述禅定。水塘是心的象征，在修习入出息念的第八步，你只需要坐在它面前观察，若给予任何指示，那就是不平静。美丽的生物（即禅相与禅那）只有在你完全平静时才会出现，他们若出来查看动静，而你“哇”，他们一定会马上退回森林，不敢再出来。如果他们出来时发现你在看着，即使你指示用眼角余光，他们也会觉察并逃跑。你若希望这些生物现身并安心玩耍，就不能移动。当你完全平静，不说话也不移动时，禅相就会出现。在这个过程中，先现身的是普通景象，然后是很美的景象，最后是非常奇特与美妙的景象，奇特到你叫不出名字，甚至无法想象出它们的存在——那些便是禅那。 阿姜查这个美妙的比喻，体现出他的智慧与深奥悟心。当你心中生起了喜与乐，了解到喜乐不外乎是用心体验呼吸所致，且能在观察呼吸的过程中保持平稳，非凡的禅那便可能出现。 步骤九：觉心（体验心）《入出息念经》的第九步被称为体验心。对于心是什么，一些人有自己的想法与观点。但只有这一阶段，你才可能真正了解、体验心。 你只能通过禅相（即心的反射）来体验心。例如眼睛。它能透过镜子看见自己（它看见的是镜子对自己的反射），而你在此禅修阶段所看见的反射（即禅相）是心的真实反射，就像照镜子，它表面的所有尘埃与污垢都已经在禅修中清除干净，心终于可以看见自己在镜子中的反射——禅相。 当禅相生起时，它的奇特几乎无法形容，我们常常用语言来比喻某样东西硬的像砖块，或软的像草……我们总是从五根的世界去引用比喻，但心的世界很难有适当的比喻。你在初次体验禅相后，心想：这到底是什么？你知道那是真实的体验，但就是很难找到描述它的完美比喻。你只能说，它像一种光，像一种禅悦的感觉，有点像这个，有点像那个。你知道它和你以前觉知的对象完全不同，但还是必须设法描述它。不管你如何描述所体验到的禅相，它们其实都是同一种觉知，只是我们使用的比喻不同罢了。 然而，对许多禅修者而言，心转瞬即来，转瞬即逝，就如动物从森林中出来，一旦觉察有人就立即逃逸。有些禅修者很难看见禅相，它们达到持续专注的觉知美丽的呼吸阶段后，却什么也没发生，它们往往因此怀疑自己哪里所错了，以下事例可以解释此种感觉。 某天深夜，我从灯光明亮的茅棚出来，走进茂密黑暗的森林。周围黑的伸手不见五指，我保持平静与安定，慢慢的，眼睛适应了黑暗，不久我就能辨识周围树木的形状，抬头也可看见美丽的星星甚至整条银河。 体验禅相可能就像这样，在无形无相的平静中，呼吸似乎消失，起初我们可能什么也看不见，但只要安忍并静静等待，正念很快会逐渐适应这个超乎过去的习惯（类似前述的明亮的房间）的“黑暗”，并且看见事物的形状。起初，我们所见的形状很模糊，但不久之后，美丽的禅相（星星）可能会出现。若持续平静的时间够持久，最佳的禅相（银河）也可能出现。 步骤十：令心喜（使禅相发亮）禅相的两个缺陷可能会阻碍禅修者的进步，禅相显得过于暗淡与禅相不稳定。为了点明这两个问题，佛陀教导入出息念的第十步和第十一步，使禅相发亮、维持禅相。“使禅相发亮”的意思是，心越是喜悦，禅相就会越明亮。如果要进入禅那，禅相必须是你所见过最明亮的事物，而且必须具有超凡之美。 为何禅相会显得黯淡甚至污浊呢？禅相只是心的反射，若禅相黯淡，则意味着你的心是黯淡的。若禅相污浊，则表明你的心被污染了。此处容不得你欺瞒或否认，因为你在直接面对最真实的心理状态。 佛陀说，若无净戒则无净定。在此，戒的重要性非常明显。若心不净，则身口意行都会受到污染。即使禅修时禅相出现了，那也将是黯淡污浊的。若这是你的经历，那你得在禅坐外多做一些净化自身行为的努力，保持戒律清净，并检视自己的话语。 慷慨慈悲、信心坚定的人，通常拥有所谓的“纯净的心”。这种内心纯净的禅修者，便是最能体验明亮禅相的人。因此，除了持戒清净之外，也要培养纯净的心。 然而，有时即使是善良的人也会见到黯淡的禅相，通常这是因为他们的心理能量很低，或许是生病或过度劳累所致。避免这类问题的方法是花点时间休息激励人心的禅法，例如忆念佛法僧三宝，并观想他们，直到内心充满喜悦。如果你原本就是非常宽厚的人，那么就可观想过去的布施来吉利自己，佛陀称此为“舍随念”。你也可以花点时间修慈。一旦心理能量提升到喜悦光明的层次，便可重回入出息念。 以上所谈的，都是在开始入出息念之前使禅相发亮的技巧。此外，在禅修期间生起的禅相若显得黯淡，以下还有四种方式可使之明亮： 一， 专注于禅相的中心。即使在黯淡的禅相里，中心也会比四周明亮，你应当温和的建议自己去看看禅相的中心。中心的亮处会慢慢扩散开来，然后你再专注于扩散亮处的中心，那会比先前羹明亮。这样反复进行，黯淡的禅相很快会变得极其明亮，且亮度会持续“激增”，直至进入禅那。 二， 强化对当下的觉知。虽然觉知当下是入出息念前期准备的一部分，但在此阶段经常会出现对当下的觉知变得迟钝的情形。更敏锐的专注于觉知当下，有助于禅修者维持正念，避免昏沉，并使禅相发亮。 三， 对禅相微笑，禅行是你内心的反射，若心微笑，禅相就会回报以笑容。禅相若一直黯淡，有可能是由嗔念引起，但微笑有足够的力量来克服这个障碍。你若不了解对禅相微笑的意思，可以去照镜子，然后微笑，并在心里对着禅相重复这个动作。 四， 返回美丽的呼吸，有时禅相黯淡，就只是因为你太早看见禅相了，因此你最好能温和的下定决心，在美丽的呼吸这个禅修阶段待久一些。即使禅相出现，若它是黯淡的，就将之忽略，并重新返回持续专注的觉知呼吸这一阶段。通常我这么做时，禅相不久就会再次出现，而且比先前更亮。当我再次忽略它时，它会持续出现并且越来越亮，直到出现真正灿烂的禅相。 你可以通过以上方式来擦亮禅相，使其自然而然的发亮，直到变得美丽而光芒四射。 步骤十一：令心摄第二个禅相缺陷是禅相的不稳定性，它会阻碍禅修的深入，使禅相快速消失。为了处理这个问题，佛陀教导出入息念的第十一步，令心摄，意思是持续观察禅相。 通常禅相初现时相当不稳定，不是一闪即逝就是不停移动。明亮有力的禅行比昏暗虚弱的禅相能维持更长时间，这正是佛陀在上一步教导我们使禅相发亮的原因。有时禅相变得光辉闪耀，而能使其保持更长时间，以便禅修者仔细观察。然而，即使是明亮的禅相也可能是不稳定的，因此我们要找寻维持禅相的最佳方法。 帮助我们维持禅相的洞见，是完全明白心中所见的禅相只是觉知者的反射。如果觉知者移动，反射的禅相也会跟着移动，就像在镜子面前盯着自己的影像一般，你移动，影像也会跟着移动，只要你不停移动，就不可能通过固定镜子来保持影响静止不动。所以，你应该专注于让心中的觉知者保持安定静止。此时，觉知者的反射影像，即禅相，就会保持稳定，静止不动并持续发出亮光。造成禅相不稳定的原因，往往是恐惧或兴奋，这表明此时的你反应过度了。初次体验禅相就像遇见一个完全陌生的人，你经常因为不认识或不知道他们如何表现而忐忑不安，然而在认识对方之后，你即可轻松的和他们交流沟通，而且很快就成为好朋友。你和他们在一起会觉得很自在，恐惧或兴奋等反应消失了。这很像小孩子学习骑自行车，一开始可能会紧抓车把，但由于身体无法放松而一直跌跤。在经历多次挫伤后，她发现越放松反而越容易保持平衡。所以，只有学会让自己放松，不去努力控制或紧抓着禅相不放，禅相才更容易维持。 我练习不控制的另一个技巧是观想开车的画面。当明亮的禅相出现时，我给它钥匙并且说，现在由你来驾驶。我完全信任明亮的禅相，我也了解心中残余的造作者，那个喜欢控制一切的怪物。它总是想搞破坏，因此我用这个比喻来帮助自己停止控制一切的行为。 在持续观察一段时间禅相之后，它会变得更加明亮且非常强大，好禅相的特征是，它们拥有你此生见过的最美丽的颜色。例如，你看到蓝色的禅相，那种蓝色一定不是普通的蓝，而是你见过的最深最美的蓝色。当你体验到美丽稳定的禅相时，便已经站在禅那世界的边缘了。 步骤十二：令心解脱入出息念的第十二步是令心解脱。在这一步你会得到一种体验，而且事后你对他可能有良好总不同的描述，这取决于你的观点：一，你发现自己沉入或潜入禅相，二，禅相以亮光及禅悦之感完全包围你。你无法事先决定自己会认同哪种观感，答案会在你放下一切造作后自然揭晓。 你将通过心的解脱而进入禅那，佛陀说禅那即是解脱。此时心从身体与五入处释放出来，解脱了一切，不是灵魂出体，心随处漂浮，而是你将不再有空间感，因为有关空间的一切觉知讲演都源自五入处。此刻你对当下发生的事不再会有任何身体的感觉，听不到任何声音，说不出一句话。你欣喜若狂，却又完全持有正念，安定，稳如磐石，这些都是心解脱的迹象。这将成为你此生最深刻的体验，或至少是最深刻的体验之一。 你若经历过禅那，通常会很想出家为僧，因为世间对你已经没有太大吸引力了。与禅那以及令心解脱的禅悦相比，交际音乐电影爱情名声财富等等，都变得不重要而且不具吸引力了。但除了禅悦之外，你还会产生更多的觉受，例如这段禅修经历的哲学深度。当你经历禅那数小时，乐意的话，你完全可以自称是神秘主义者，这经验极不平常，佛陀称此为超常人之法，或为心的大至。佛陀也认为禅那之乐很像正觉乐，那时没有烦恼的地方，摩罗无法进入的地方，你在此时是觉醒而解脱的。 所以，加入你能修习入出息念的前十二步，它们将会引领你进入禅那。 退出禅那 入出息念经的后四步，是针对刚刚退出禅那的修行者。第一次退出禅那境界时，你会禁不住想，哇，那是什么。因此，你应该做的第一件事就是审视禅那，以便探究这段体验禅那的经历。你应该问，它如何生起？我做了什么特别的事情吗？禅那中的感觉像什么？为何有如此的感觉？我现在感觉如何？为何它令人呢如此快乐？……这些深思将为你带来深刻的洞见。 你会发现描述禅那为何发生的最佳词语是放下。现在你算是第一次真正地放下了——不是放下所执着的事物，而是放下产生执着的事物，你已经放下造作者，放下了自我。要你放下自我相当困难，但通过系统的练习后，你确实办到了，这便是禅悦。通过审视这段经历，你便可以选择修习念处，或直接进到入出息念的后四步。 步骤十三：无常行（随观无常）第一随观是针对无常。无常的反面是常，意指规律或恒常的事物。以佛陀所制的戒法典籍《律藏》中规律性的施食为例，某个弟子每周二都带食物来寺院，即称为常施食，一旦停止这么做，便是无常。在经历深刻的禅修之后，禅修者所观见的须为恒常的事物，因为它是在太恒常了，所以你从来没有注意过它，那就是我，但在禅那中，我消失了，请注意，随观我的消失会让你深悟无我的真谛，并很可能会带来入流的体验。 步骤十四：观离欲（随观事物消逝）若无法随观无常，你还可观见离欲，即指事物刚刚消逝之际。你在进入禅那之后，将会看见许多事物消失，其中有些和你密切相关，以致你会认为它们是你身边不可或缺的一部分。然而，当它们都在禅那中消失的时候，你将体验到自我的消逝。 步骤十五，随观灭第三个随观应该是观灭。所谓灭，是指某个曾经存在但如今已完全消失的事物——它已经不见踪影，其所在的地方如今空无一物。禅修者只有持续深入地禅修，才可能觉知这种空。此时此处，宇宙中许多你原本认为是实体的事物都已经不复存在，你处在一个完全不同的时空里。 灭也是第三圣谛，乃是苦的终结，其因是放下。你若真的放下，百分之九十九的苦便告止息。那么还剩下什么呢？苦的反面是什么？乐，苦的止息即是乐。因为许多苦已经止息，所以乐才会生起。因此你应该观见，禅那是你此生最快乐的体验。……例如，当你终于偿清买房贷款之后，为了还债而必须经年累月努力工作的痛苦消失了，你也会因此感到无比高兴。可见，人们体验到的快乐常常源于先前所承受的痛苦的消逝。 步骤十六，观舍遣入出息念经的最后一步是随观舍遣。舍遣，在本文中是指舍弃此处的，而非彼处的。人们通常认为佛教是出世的，但舍遣却是舍弃内在的世间，舍弃造作者，甚至舍弃觉知者。你若非常仔细的观察，将会发现在禅那中所发生的事，不只与外在世间无关，同时也和内在世间无关，尤其是脱离了造作者、意志、控制者。这样观见，你将体验到快乐清净解脱禅悦，即已找到灭苦之道。 以上所述是佛陀教导的修习入出息念的集中方法，这是一个完整的修行法门，从最简单的于僻静处舒适坐下开始，然后系念在前，且单纯的观察呼吸……一步接一步，都是你有能力付诸实践的步骤，最后你将达到禅那的深奥禅悦境界。 当你退出禅那时，有四件事要注意，事物的无常或不确定性，事物的消逝，自我的息灭，以及舍遣此处的一切。你若在体验禅那之后随观这些事物，有些事情就会接着发生。禅那是火药而随观是火柴，当你把两者凑在一起时就一定会燃起火焰。 希望你们都能体验到这些所谓觉悟的美丽火焰。","categories":[{"name":"tradition","slug":"tradition","permalink":"https://www.easonx.cn/categories/tradition/"}],"tags":[{"name":"佛法","slug":"佛法","permalink":"https://www.easonx.cn/tags/%E4%BD%9B%E6%B3%95/"},{"name":"禅定","slug":"禅定","permalink":"https://www.easonx.cn/tags/%E7%A6%85%E5%AE%9A/"},{"name":"止禅","slug":"止禅","permalink":"https://www.easonx.cn/tags/%E6%AD%A2%E7%A6%85/"}]},{"title":"【转】呼吸禅定步骤","slug":"the-steps-of-breath-meditation","date":"2020-07-05T16:00:00.000Z","updated":"2020-07-08T11:05:58.620Z","comments":true,"path":"2020/07/06/the-steps-of-breath-meditation/","link":"","permalink":"https://www.easonx.cn/2020/07/06/the-steps-of-breath-meditation/","excerpt":"[作者]坦尼沙罗尊者[中译]良稹讲于2002年11月，美国慈林寺The Steps of Breath Meditationby Ven. Thanissaro Bhikkhu​ 佛陀传授呼吸禅定时，所教共有十六步。这是经文中最详细的禅定指导。而呼吸则是佛陀最高度、最常推荐的禅定主题——因为呼吸不仅是心智借以安定集中之所缘，也是心智作分析的对象。那里是觉醒洞见升起之处——心智对呼吸有念住、有警觉，也对自己与呼吸之间的关系有觉知。","text":"[作者]坦尼沙罗尊者[中译]良稹讲于2002年11月，美国慈林寺The Steps of Breath Meditationby Ven. Thanissaro Bhikkhu​ 佛陀传授呼吸禅定时，所教共有十六步。这是经文中最详细的禅定指导。而呼吸则是佛陀最高度、最常推荐的禅定主题——因为呼吸不仅是心智借以安定集中之所缘，也是心智作分析的对象。那里是觉醒洞见升起之处——心智对呼吸有念住、有警觉，也对自己与呼吸之间的关系有觉知。 在呼吸禅定的后续阶段，重点不再是呼吸，而是心智与呼吸的关系。不过初始阶段，重点在呼吸本身，用呼吸把心智套牢，把它带至当下。最初两步里，你仅只跟踪长呼吸与短呼吸，使自己对长短呼吸的意识敏感起来。不过从第三步开始，便有了意志的成分。你要训练自己，首先是，随著吸气，对全身有觉知，随著呼气，对全身有觉知。 佛陀在描述禅定境界时，并未采用一境性（single-pointedness）的形象。他用的是全身意识的形象。当呼吸禅定产生喜与乐的觉 受时，他告诉你，把喜感与乐感，如发面时把水揉入面粉一般传遍全身。另一个形象是，喜悦从体内升起，如冷泉水从湖底涌出，给整湖水带来清凉。另一个形象是湖中直立的荷苞：有的未伸出水面，而是整个沉浸于水中，从根部到苞顶为湖水的静止与清凉所饱和。再有一个形象是，一个包著白布的人，从头到脚裹著白布，全身盖著白布。 这些都是全身意识的形象，是喜、乐、明亮的意识充满全身的觉受。你在理解呼吸时需要尝试达到的正在于此，因为让洞见升起的那类意识，并非限制于一点。当你把注意力集中于一点，其它一概堵在觉知之外时，心智也会留下许多盲点。但是你试著维持一种全方位的意识感时，就有助于消除盲点。换句话说，你要沉浸于呼吸之中，对周身的呼吸有觉知。用来描述它的一个词是kayagatasati——念住浸没于全身。身体为觉知所饱和，觉知本身又沉浸于身体、为身体包围。因此并非你仅只注意一点——例如头部后方——从那一点看身体，或者从那点出发堵住对身体其它部分的觉知。你必须有全身的知觉，有全方位、三百六十度的觉知，那样就消除了心智里的盲点。 你一旦有了这样的觉知，就要致力于维持它——尽管“致力”与一般的致力并不同。你致力于不把意识移开、不让它萎缩。你致力于不去担负其它的责任。不过时间长了，这样的调御就越来越自然、越来越成为第二天性。你感觉越来越自在。随著心安定下来，它平时的紧张能量就开始消解。身体实际需要的氧气越来越少，因为你的大脑活动程度开始平息下来，呼吸也越来越精细。它甚至可以达到完全静止，因为你需要的氧气只需从皮肤的毛孔中获取。 在这时，呼吸与你的觉知似乎融合在一起。很难把两者分开，不过你暂时不要尝试去分开。就让知觉与呼吸相互贯通，成为一体。 你必须把这样的意识，这种一体感，练得极其稳固。否则它很容易遭到破坏，因为心智的天性会任其萎缩。我们一开始思考，身体某处的能量场就收缩起来，从意识中给堵了出去，这就是为什么每次一个念头出来，身体就会有张力。身体这部分紧张起来，让你去思考那个念头；身体那部分紧张起来，让你去考虑这个想法，就这样来来回回。难怪一个简单的思考过程也会让身体大量消耗。根据一些中医学说，脑力劳动者消耗能量的速度，比一个完全的体力劳动者要快三倍。这是因为思考给身体带来紧张。特别是那些有关过去未来的想法，必须造出一个世界来，才能让那些想法有地方居留。 我们使心智集中起来时，是在以一个不同的方式思考。初始阶段我们仍在思考，不过所想之事完全关乎当下，完全在观察当下，对当下发生的事件有警觉、有念住，这样就不必去创造过去、未来世界。这样给身体造成的张力就减少了。为了保持对当下的念住，不让心思溜回旧习，你必须尽量保持开阔的觉知，直至包括对你的手指、脚趾的觉知，那样才让你扎根于当下。你的觉知保持著开阔感时，就能够防止产生那种收缩性，它允许心智溜出去跟踪过去与将来。你就完全安住于当下。思考的需要变得越来越少。 随著念头越来越少，不去干扰呼吸能量的流动，会产生一种全身的满足感。经文中把这种满足感称为喜，而称随之而来的自在感称为乐。你就让这个自在的满足感充满全身，但仍然把注意力放在呼吸能量上，即使它已完全静止。你不必匆忙，不过最后会达到一个地步，身与心经历了足够的喜与乐，你可以让它们平息下来。或者有时喜念太强烈了，那时你就让更为精细的呼吸感，进入喜悦中的觉知， 接下来你转入一个完全自在的层次。之后连自在感——一种啜饮愉悦的感觉——也平息了，把你留在了彻底的寂止状态。 你在寂止中定驻下来后，可以开始寻找呼吸与觉知之间的分界线。在此之前，你一直在调御呼吸，尝试怎样呼吸法最舒适，怎样不舒适，对此越来越敏感，你的调御越来越精细，直到可以放下调御，与呼吸同一体。这样做，就使呼吸越来越精细，直到它彻底静止。当一切稳定静止下来之后，你的知觉和知觉对象自然而然就分开了，好比悬浮液中的化学物质沉淀下来。一旦知觉分离了出来，你可以开始直接调御心理因素，即影响你的觉知的感受(feelings，受)与辨识(perceptions，想)了。你可以观察它们的行为，因为目前呼吸已不作干扰。 这好比调节无线电频道。只要有杂音，只要你还不曾调准电台频率，就听不见讯号的微妙。但是你一旦调到了那个频率，杂音消失，各种细节会清晰起来。你调到心智的频道，就能看见受与想的细微动态。你能看见那些动作的结果对你觉知的影响，过一阵，你会了解这种影响越精细越好。如此使它们安静下来。等它们安静下来时，你就剩下了觉知本身。 不过，即使这个觉 知也有上下起伏的时候，为了超越它们，佛陀让你调御它们，如同你调御呼吸、调御受、想扥心理因素一样。经文上谈到令心胜喜、令心定、令心解脱。换句话说，在你对禅定各个阶段越来越熟悉时，就会开始对知觉当前所需要的禅定层次有所了解。假如它不稳定，怎样让它稳定下来？你怎样改变呼吸的感应，或者调整你的注意力让心智更加稳定？禅定枯燥起来时怎样做才能令心胜喜？从一个阶段移到下一个阶段，你确切需要放下什么，才能让心智离开一个比较弱的禅定境界，让它在一个更强的境界里安住下来？ 佛陀在谈到修持这个阶段里的心解脱时，并不是在讲彻底解脱。他讲的解脱，是指比如你放下初禅的寻想(direct thought，寻)与评量(evaluation，伺)，让自己这两个禅支的负担中解脱出来，同时进入第二禅那，以此类推地进入不同禅定层次的情形。你这样做时就会看到，出入那些层次，很多意义上是凭借意志进行的。这一点很重要。你在禅定中，从一个阶段转到下一个阶段，在心目一角注意，为了从一种体验呼吸的方式转到下一种方式、从一种稳定性转到下一个层次的稳定性，自己在做些什么，就会升起洞见。你可以看见，很多意义上这是一种心意所造的现象。 这样做，最后就把呼吸禅定引向了洞见。首先，有了无常的洞见，不仅是对于呼吸，而且更重要的是对于心智本身，因为你看见，即使那些稳定、清新的禅定层次也是可以藉著意志产生的。在这一切清新、一切稳定的状态之下，是一种重复的意志、意志、维持禅定状态的意志。有一种累赘的元素存在著。对于无常的洞见，与其说是你怎样消化经验，不如说是你怎样产生经验。你看见为了产生某一种特别的经验需要付出的一切努力，就产生了问题：“这样做值得吗？这样一直不停地产生、产生、产生这些经验，难道不累赘吗？” 之后问题变成了：“怎样放下这个累赘呢？” 假如你不制造这些禅定境界，你唯一的选择是不是就回去制造其它种类的经验呢？或者有可能根本不去制造任何经验？我们的一切常规经验，无论是在禅定之中还是禅定以外，每分每刻，都具有某种意愿、意志的成分。你现在到了一个地步，那种意愿的成分、意志的成分，开始明显地成为累赘。特别是你环顾四周，问道：“我是为谁制造这个？到底是谁在体验它？” 你就开始看见，你的自我感、这个体验者是谁，是很难确定的，因为它由五蕴组成，五蕴本身是无常、苦、非我的。这位体验者也是制造出来的。这样就产生了经文中称为nibbada的素质，可以译成觉醒、幻灭。有时候译文意义更强烈：厌弃。不管怎样有一种你受够了的感觉。你觉得沦陷于这个过程。你不再觉得这里有任何满足感。你要找一条出路。 因此你就把注意力放在舍弃。根据经文，首先集中于无欲(dispassion，离贪)，然后集中于止息(cessation，灭)，最后是一种彻底的出离。换句话说，在最后阶段，你放下作为制造者、体验者、观察者的每一个动作、每一种意愿，哪怕是那些组成正道的辨知(想蕴)与思维构造(行蕴)。当正道的因素完成了它们的工作，你也把它们放下。 所有这一切就围绕著呼吸发生，在身与心交集的这一点上发生。这就是为什么佛陀从来没有让你把呼吸这个禅定主题彻底放下。解脱道上的进展，正来自安住于当下，正是对这周围发生的一切，越来越有知觉。你培养出一种全方位的知觉，不仅仅是身体的全方位，而且是心智的全方位。你看穿了那些盲点，是它们让你明知自己在体会各种经验，却忘记了你必须制造那些经验这个事实。就好像在看电影——灯光在屏幕上闪动了两小时——接下来看一个讲述这部电影摄制过程的纪录片。你意识到，这上面耗费了几个月、有时几年的工夫，于是问题升起了：“这样做值得吗？” 区区几个小时的享受，之后你就遗忘了——尽管为了制造它，花了那一切辛苦。 因此当你以同样方式看待你的一切经验，看见制造它们时付出的那一切努力，问自己是否值得时：那个时候你就真正开始看穿幻相、开始觉醒，那个时候你就真的能放下了。你放下的不仅是来来去去的辨知与感觉，而且放下了制造它们的行为。你看见这种制造行为无处不在，包括了你的一切经验。你无论善巧还是缺乏技巧，总是在制造什么。心智每升起一个愿望、每作一次选择，就是在不断地制造。这样看，就有了压迫感；这也在最后促使你舍弃。 你舍弃了制造、舍弃了创造。舍弃之后豁然开朗。心智面向了一个全新的维度，非创造、无升起、无消逝。尽管那一刻没有呼吸感、没有身体感、没有心智的操作与创造、作为体验者与制造者的感觉，但也是直接与当下相接触。佛陀谈到这里时，他的所有言辞都是比喻，所有的比喻都有关于自由。你试图描述那个状态，也只能说到这里，但是怎样达到那个状态，却可以说很多。那就是为什么佛陀的教导如此详细。他列出了所有的步骤， 详细解说怎样到达那里。但是假如你想知道终点究竟如何，不要去寻找它的详细描述。只要跟随那些步骤，你在当下就会有亲身的了解。","categories":[{"name":"tradition","slug":"tradition","permalink":"https://www.easonx.cn/categories/tradition/"}],"tags":[{"name":"佛法","slug":"佛法","permalink":"https://www.easonx.cn/tags/%E4%BD%9B%E6%B3%95/"},{"name":"禅定","slug":"禅定","permalink":"https://www.easonx.cn/tags/%E7%A6%85%E5%AE%9A/"},{"name":"止禅","slug":"止禅","permalink":"https://www.easonx.cn/tags/%E6%AD%A2%E7%A6%85/"}]},{"title":"增.11.15 慈爱功德经","slug":"2019-03-14-metta-merit-scripture","date":"2019-03-13T16:00:00.000Z","updated":"2020-07-08T11:05:58.612Z","comments":true,"path":"2019/03/14/2019-03-14-metta-merit-scripture/","link":"","permalink":"https://www.easonx.cn/2019/03/14/2019-03-14-metta-merit-scripture/","excerpt":"慈爱功德经 如是我闻：一时，跋葛瓦住在沙瓦提城揭德林给孤独园。","text":"慈爱功德经 如是我闻：一时，跋葛瓦住在沙瓦提城揭德林给孤独园。 于其处，跋葛瓦称呼比库们：“诸比库。”那些比库回答跋葛瓦:“尊者。”跋葛瓦如此说： “诸比库，于慈心解脱习行、修习、多作、习惯、作根基、实行、熟练、善精勤者，可期望十一种功德。哪十一种呢？ 睡眠安乐，醒来快乐，不见恶梦，人们喜爱，非人喜爱，诸天守护，不为火、毒、刀所伤，心迅速得定，面容明净，死时不昏迷，不通达上位则至梵天界。 诸比库，于慈心解脱习行、修习、多作、习惯、作根基、实行、熟练、善精勤者，可期望此十一种功德。”跋葛瓦如此说。那些比库满意与欢喜跋葛瓦之所说。 玛欣德比库敬译 Translated by Mahinda Bhikkhu","categories":[{"name":"tradition","slug":"tradition","permalink":"https://www.easonx.cn/categories/tradition/"}],"tags":[{"name":"佛法","slug":"佛法","permalink":"https://www.easonx.cn/tags/%E4%BD%9B%E6%B3%95/"},{"name":"慈心","slug":"慈心","permalink":"https://www.easonx.cn/tags/%E6%85%88%E5%BF%83/"},{"name":"功德","slug":"功德","permalink":"https://www.easonx.cn/tags/%E5%8A%9F%E5%BE%B7/"}]},{"title":"慈心观的练习","slug":"2018-11-01-metta-bhavana","date":"2018-10-31T16:00:00.000Z","updated":"2020-07-08T11:05:58.608Z","comments":true,"path":"2018/11/01/2018-11-01-metta-bhavana/","link":"","permalink":"https://www.easonx.cn/2018/11/01/2018-11-01-metta-bhavana/","excerpt":"慈心观(Metta Bhavana)在佛法中常见于上座部佛教（南传佛教），据说是佛陀亲自传授的一种方法，适合嗔恨心比较重的人练习。佛法像体育运动，需要经常训练，以期达到熟练的地步。自然流露的慈心可以为自己带来殊胜的好处，同时也可以利益他人。","text":"慈心观(Metta Bhavana)在佛法中常见于上座部佛教（南传佛教），据说是佛陀亲自传授的一种方法，适合嗔恨心比较重的人练习。佛法像体育运动，需要经常训练，以期达到熟练的地步。自然流露的慈心可以为自己带来殊胜的好处，同时也可以利益他人。 ### 慈心观的所缘 ### 所缘是心抓取的对象，比如慈心观的所缘可设定为一个人的影像，需要我们在静坐时，进行有影像的做意，最好是想象这个人微笑着在你的面前，可以取近景的特写，也可以取上半身或全身，或坐或站。因人而异，你觉得哪种比较好就用哪种，博主目前是取近景。所缘最好不要是一个人的几幅影像更迭，最好固定为一幅，并且影像是静态的。因为如果影像象电影一样在动，说明你的心没有静下来。 ### 慈心观的发送 ### 如果自己当前比较烦闷，情绪不好，可以先给自己发送慈心，结跏趺坐或者是任何姿势，在心里想象自己微笑着的影像，按照以下含义： 祝自己远离一切危险和痛苦；祝自己远离一切内心的痛苦；祝自己远离一切身体的痛苦；祝自己一切平安幸福快乐。 这样在心里默念3次，可以是每一句话重复3次后，接下一句话，也可以等四句话默念一遍结束后，再重复2次，看自己的喜好（博主是用第一种）。发送慈心的前提条件是自己需要先平静下来，否则给其余人发送慈心效果肯定不理想。 如果自己情绪很好或者觉得自己可以很快调整好，可以跳过自己，直接开始给其他人发送慈心，一共有四种类型的人。第一种类型是自己尊敬的人，可选择老师或者亲属。但是最好不要是和自己极亲密的人，因为发放慈心的时候，如果他正遭受一些疾病，你的心就可能伤感悲痛，而不能正常发送慈心。而且不能单独发送给异性，因为是异性，自己心中很容易就生出贪爱，也不能是已经去世的人。当你需要入禅定，也不要发送慈心给自己，发送慈心给自己只能进入近行定，无法进入安止定。 内容仍然重复以上四句，唯一的区别，只是所缘从“自己”变成了“尊敬的人”。你最好保持微笑，这样有助于缓解自己紧张的情绪。最重要的是持续的发放慈心，你的心感觉到欢喜。 第二种类型是自己喜爱的人，可选择一个同性的朋友或兄弟，按照相同的四句话进行慈心发送。 第三种类型是中性的人，自己不喜欢也不讨厌，平时没有多少交集，可选择邻居或者同事，开始进行慈心的发送。 第四种类型是自己讨厌的人，你见到就心生厌烦的人。不过，最好不要是起过冲突的人，因为如果你们起过冲突，你可能带有嗔恨的心，慈心会无法发送出来。 对这四种类型的人发送之后，可以换另外一组四种类型的人，自己尊敬的人、喜爱的人、中性的人、讨厌的人，对他们继续进行慈心的发送，以此类推，循环往复。 ### 慈心观的好处 ### 慈心观有11种功德，这里先不提供，有心的朋友可以去网上查找下。博主这边只列出自己觉得受用的一些好处，从我个人的角度实践出来，才能作为自己公众号里的文字，否则就只能引用。 第一，能迅速入睡，睡眠不会做恶梦（我的理解，经常训练自己的心，让它处在一个柔和的状态，这个状态久了，就会在睡眠的状态中保持）；第二，打坐时候能快速的静下来，心中妄念较少（以慈心代替妄念，只要一直发送，确实能减少甚至消灭妄念）；第三，心中常怀慈心，别人会更加喜欢你，关系会更融洽（当然，话说回来，别人不一定会因为你发送过慈心或面带微笑而改变，重要的是你自己得了利益）。 ### 无界限遍满慈 ### 等慈心观熟练了以后，可以给十个方位（东方、西方、北方、南方、东南方、西北方、东北方、西南方、下方、上方）的有情众生发送慈心，破除种族、男女、强弱、高矮、大小等等的界限，范围可以指定为一个区域，街道、公园、地铁、学校、商场等等。此时的所缘没有一个具体的影像，变成了一种感觉。可以想象自己的慈心是螺旋状或者是辐射状，以自己为中心向周围扩张，保持你的慈心不要中断。这就是无界限遍满慈。 真正修证佛法的态度，应该用科学的眼光，不论是南传、藏传、北传，我们不盲目的相信。存在即合理，真有闪光点要善于发现，有缺陷也要悉心分辨。学佛的人应该把身心都调柔，胸襟大，拿得起放得下，看一切事情都没有不顺眼，面孔对所有人都是慈悲笑容。所以先改变自己的内心，在心上下功夫，把心结解开，老老实实一门深入，一步一步的求证。","categories":[{"name":"tradition","slug":"tradition","permalink":"https://www.easonx.cn/categories/tradition/"}],"tags":[{"name":"佛法","slug":"佛法","permalink":"https://www.easonx.cn/tags/%E4%BD%9B%E6%B3%95/"},{"name":"慈心观","slug":"慈心观","permalink":"https://www.easonx.cn/tags/%E6%85%88%E5%BF%83%E8%A7%82/"},{"name":"训练","slug":"训练","permalink":"https://www.easonx.cn/tags/%E8%AE%AD%E7%BB%83/"}]},{"title":"火眼金睛选股票","slug":"2018-09-22-pick-stock","date":"2018-09-21T16:00:00.000Z","updated":"2020-07-08T11:05:58.604Z","comments":true,"path":"2018/09/22/2018-09-22-pick-stock/","link":"","permalink":"https://www.easonx.cn/2018/09/22/2018-09-22-pick-stock/","excerpt":"投资股票有四个步骤，空仓、买入、持有、卖出。空仓包含了选股的时间，选股是一个相对比较耗费时间的行为，从几千只股票中能否选出好的股票，直接决定了交易的成败。","text":"投资股票有四个步骤，空仓、买入、持有、卖出。空仓包含了选股的时间，选股是一个相对比较耗费时间的行为，从几千只股票中能否选出好的股票，直接决定了交易的成败。 四象的重要性选股技术在空仓中最为重要。总选出烂的股票还不如空仓，不让交易随随便便进入买入的阶段。买入和卖出技术很重要，因为买入和卖出价位是一个区间，需要事先计算好区域，制定标准，盘中根据标准操作。如果选股、买入、卖出时候的技术都运用恰当，那么持有的过程才是轻而易举。所以，只有好的股票还不够，需要买入卖出技术的配合，才能发挥最大的威力。 ### K线 ### 一支股票所有的信息都会在K线上表现出来，直接解读K线，不掺杂其他信息，更有效。如今用电脑可以方便的看到K线的历史，能反映出多方和空方交战的痕迹，我们需要对这些图形进行分析，形成我们的操作思路。 在日线图上找我们需要的图形，这里以新天药业 这支股票为例（见下图）。 新天药业和上证指数（蓝色）对比图，时间是2018年1月23号到2018年4月16号 从2018年2月2号开始，新天药业用了几天时间构筑了双底雏形的左底，一直到2月12号，走势是上涨的，期间大盘（上证指数）下跌了将近10%。随后新天药业一直横盘，没有跌破2号的最低点21.03元，到3月20号这天出现了一根涨幅5.26%的大阳线，成功构筑了双底雏形的右底。从K线形态来看，3月20号并没有突破颈线位（2月26的最高点24.15元），形态并未构筑成功，但是成功站上了七天均线，日线买入信号已经出现。后续四天除了21号是阴线，22、23、26号都是阳线，3月22号成功突破了颈线位，从形态上看这四天时间里都可以买入（这只股票已经给足了买入的时间，没有急于拉升），但是最低点位只出现在21号的收盘时间。查看2月2号到3月20号的换手率，都在10%以下，只有3月20号一天达到了13.4%。主力介入程度不是特别高，加上这个股票是次新股，博主当时估算信号出现后是短期的行情。实际情况确实是短期行情，等到4月12号这一天，最高点的涨幅居然达到了60%。 总结一下以上选股的条件：1.走势强于大盘 2.大阳线站上某个均线 3. 有良好的换手率配合，换手率最好在10%~20%之间 前两个条件是必须的，最后一个条件没有那么重要。 在同花顺软件里，按键盘F10，点击财务概况。按报告期查看净利润同比增长率，可以看到和去年同期相比，净利润基本增长都在10%到30%之间，说明盈利能力在逐步成长。再点击行业对比，中成药行业有70家，新天药业的销售毛利率排在10多名，基本处在行业上游，该股财务情况良好。财务面可以在K线形态分析后，作为衡量股票价值的一个辅助因素，但不是我们操作股票所关注的主要矛盾。 炒股，既可以说里面的理念有如兵法、阵法、策略，也可以说某个操作模式像武术中的太极拳或咏春拳，这些都偏向于技术和能力层面，也就是技法和功法。更重要的是心法，如果你能做到一心不乱，也就是在股票涨跌时都保持自己的内心不随意产生烦恼，随后进步会一点点到来。","categories":[{"name":"invest","slug":"invest","permalink":"https://www.easonx.cn/categories/invest/"}],"tags":[{"name":"投资","slug":"投资","permalink":"https://www.easonx.cn/tags/%E6%8A%95%E8%B5%84/"},{"name":"股票","slug":"股票","permalink":"https://www.easonx.cn/tags/%E8%82%A1%E7%A5%A8/"}]},{"title":"股票投资小贴士（壹）","slug":"2018-07-04-stock-tips-1","date":"2018-07-03T16:00:00.000Z","updated":"2020-07-08T11:05:58.600Z","comments":true,"path":"2018/07/04/2018-07-04-stock-tips-1/","link":"","permalink":"https://www.easonx.cn/2018/07/04/2018-07-04-stock-tips-1/","excerpt":"本系列文章会总结股票要素的含义和常见词语的解释，类似平时的学习笔记，讲明重点，一目了然。","text":"本系列文章会总结股票要素的含义和常见词语的解释，类似平时的学习笔记，讲明重点，一目了然。 日换手率计算方法：日成交金额/流通值×100%（以同花顺行情软件为准）。 换手率如果在10%到20%的区间，是机构大幅介入的股票，可以优先挑选。如果换手率在20%以上，要留意盘面出现异动（上下振幅很大，一天内大跌或大涨等等），随着换手率的增加，相对操作难度要大些。 如果股票一天的涨幅是8%，换手率只有2.4%及以下，说明主力只需要不多的筹码就可以将股票拉到涨停的位置，这是一支控盘的股票。这个标准，涨幅除以换手率要大于等于3,也就是说，涨幅是8%，如果换手率超过了2.7%，则不能有以上控盘的判断。 换手率高或低与上涨或下跌无关，换手率指标只说明交易活跃。 左侧交易和右侧交易左右两侧交易的分水岭是买入信号，买入的信号是一根涨幅较大的K线。要求更严格一些，是大于等于4%(也可以是5%，标准因个人而异，如果做市场上最强的股票，标准可以设高一点)的K线，并且价格要站上重心位（均线所处的位置），价格在重心位以下的阳线不算在内。买入信号出现后买入，右侧交易；买入信号出现之前买入，左侧交易。左侧交易是激进的操作，如果做对，收益比右侧交易要多，一旦做错，股票有继续下挫的风险；右侧交易是稳健的操作，相对收益比左侧交易要少，因为是看到信号再行动，相对风险也比左侧交易要少。 左侧信号，多用于下跌尾声或超跌反弹的时候；本博主推荐做右侧交易，确认信号后再做打算。 超跌反弹股价上方20%的空间，只有10%不到的筹码。此含义可通过公式表达出来，指南针软件里的函数是ASR(20,0)&lt;10，可结合CYS (市场盈亏，表示投资者在某一段时间内的平均盈利情况)指标进行进一步的筛选，CYS13 = -5的含义是13天内进场的投资者平均亏损达到了5%。编写公式时，超跌的标准一般是CYS13 &lt; -16。当个股和大盘都达到超跌的情况下，买入后获利的概率最高。超跌反弹属于左侧交易，稳健的投资者可少使用。","categories":[{"name":"invest","slug":"invest","permalink":"https://www.easonx.cn/categories/invest/"}],"tags":[{"name":"投资","slug":"投资","permalink":"https://www.easonx.cn/tags/%E6%8A%95%E8%B5%84/"},{"name":"股票","slug":"股票","permalink":"https://www.easonx.cn/tags/%E8%82%A1%E7%A5%A8/"}]},{"title":"游关西","slug":"2018-06-26-jpn-journey","date":"2018-06-25T16:00:00.000Z","updated":"2020-07-10T02:31:23.080Z","comments":true,"path":"2018/06/26/2018-06-26-jpn-journey/","link":"","permalink":"https://www.easonx.cn/2018/06/26/2018-06-26-jpn-journey/","excerpt":"端午时节，博主开始了日本之行。人在一个地方待的久了，总是会习惯性的记下这个地方的好处和坏处，等到了远方的国度，便不由自主的开始进行比较，很多人会自动察觉自己哪里做的不够好，但是又没有找到更好的解决办法，这个时候一般都会看向别人，从优秀的人身上，发现自己真正的差距。","text":"端午时节，博主开始了日本之行。人在一个地方待的久了，总是会习惯性的记下这个地方的好处和坏处，等到了远方的国度，便不由自主的开始进行比较，很多人会自动察觉自己哪里做的不够好，但是又没有找到更好的解决办法，这个时候一般都会看向别人，从优秀的人身上，发现自己真正的差距。 关西机场从飞机上下来，天空蓝的得特别的清澈，云朵很白，不是很多，衬托出天空的蓝，这种蓝是透彻、纤尘不染的，确实比上海的天空好看，大概中国只有云南等边陲省份一带的天空才会经常呈现这样的效果。机场跑道上人不是很多，飞机也似乎只有我们这一架，加上好天气的加分，无疑形成了一种视觉冲击。走到入境的海关，这里的室内环境也很干净，设施也没有用旧的痕迹。等入境后就可以自由行动了，飞机到达的是T2航站楼，可坐短驳车摆渡到T1航站楼。在T1航站楼有JR 列车，可以坐上去 京都、大阪、难波等地区。 可使用ICOCA卡（企鹅卡）作为交通卡走遍关西地区，博主是直接在淘宝网上购买。ICOCA卡也可在7-ELEVEN、全家等便利店消费，默认1500日元的初始金额，500日元押金。如果金额不够了，可以去地铁站的自动充值机充值，很方便。 在关西机场乘坐JR列车和国内乘坐地铁稍有不同的是，前者可以在网上预约，预约的按钮在页面最下方： http://www.westjr.co.jp/global/sc/ticket/icoca-haruka/ 这里的步骤稍微有些麻烦，需要网上填写好信息，因为已经有了ICOCA卡，所以下拉列表里要选择ICOCA holders的个数。护照号、邮箱地址一定要填写正确，目的地因为博主是去京都，所以选择Kyoto, Saga-Arashiyama。最后点击Confirm，收到邮件后用A4纸打印出来放到包包里一起带到关西机场。大概是中午11点半到达JR列车的购票处，似乎这个时间段只有我们这一架飞机，没有什么人排队，直接进去和中文的导购妹子说你有ICOCA卡，需要买HARUKA单程票就可以了（其他所有的有效信息都在打印的单子上，递出去给导购），现金1600日元，她会很快的把车票给你。这样的流程是最快的，当然你什么卡都不买也行，直接在这里买ICOCA&amp;HARUKA折扣券，会多花2000日元ICOCA卡的价格，价格上也没有不一样。 京都市坐上JR列车，到达京都站。京都这个城市很小，给人的感觉是干净，京都站的2楼是进出站的地方，1楼内部是各种商铺，沿街的外面也是商铺，这个人流密集的场所，按道理应该会比较脏乱，令人惊讶的是京都站内部外部非常干净，让人不由得心生敬佩。出来在路上兜了一个小圈，到了新都酒店。酒店的接待员很负责，他们会很热情的用手势和微笑给你指明排队的方向。正在柜台办理入住时，边上的服务员主动把博主的行李箱放到推车上，帮忙一直送到房门前，拿着房卡开始示范如何开门，进门后又介绍空调怎么开，讲话像连珠炮，一个劲的鞠躬点头，离开的时候是面朝房间并且把门关上。有点过度热情，让人觉得浑身不自在：），后来在大阪酒店的实习生，待人接物就是正常的风格，没有多余的话。 京都的信号灯也很有意思，除了红色和绿色的行人标志提醒，绿灯的时候还会发出鸟叫的声音，啾一声，停顿后再发出啾啾两声，如此循环下去。信号灯上没有倒计时的数字，这样设计比较人性化，京都站边上是四车道，再加上街道也不是很宽，车开的比较慢，行人过街心理上的紧迫感比较少。地铁的出入口闸机没有栏杆或门（很人性化，国内是否可以借鉴下），如果你是坐地下铁，可直接刷企鹅卡进站。如果是从难波地区坐南海特急这样“特急”的列车，就需要另外在售票机上买票。不过你忘了也没有关系，有些车次还会有售票员专门查票，可以上车后补票。 到日本关西的各个景点都不需要打车，因为在日本打出租车的价格较贵，一般公交车或地铁就已经能满足出行需要，手机上最好装个谷歌地图，这样查路线非常方便。 清水寺清水寺前面是山坡，沿着山坡往上走，路边是商店和居民房的组合，随处可见的饮料售卖机，上面售卖各式各样的饮料，而且都很冰，绝对不会像魔都的便利店或者售卖机的温度，那个温度只能算是清凉，没有冰冻的感觉。日本饭店、便利店和售卖机的水，基本上全部都是非常冰。走到一个小店里，问了下营业员为什么路面上没有垃圾桶，解释说是日本人没有随手丢垃圾的习惯，而且他们也怕这种藏东西的地方会有炸弹（很清奇的解释^-^ ）。说完后这位中国营业员妹子很贴心，给了博主一个塑料袋装垃圾。 估计清水寺内部正在装修，有佛像的区域没有放游客进入，所以只能在外围看一下。正好边上有个日本僧侣在化缘，博主供养了一些日元，双手合十，他给了博主两片形状像凤凰羽毛的印有美丽图案的纸片，不知道有什么含义，晚上回酒店打坐，轻安的感觉比平常要明显，效果也比平时好。 下山的时候是一条商业街，人突然多起来，不过博主没有在这里买东西。最后快走出清水寺地区时，看到一辆卡车准备从山坡开到街道上，估计是可视角度比较小，卡车前方有个大叔，会不时提醒路人不要经过卡车前面，看到这个场景，立刻觉得日本普通人的工作也是非常严谨、细致的。后来看到一个工地，发现日本的工地施工也很严谨，会在外墙写明工作时间周一到周六，周日休息，液晶屏会实时显示工地的噪音分贝，卡车开进工地后，工人会立刻把大门关好，估计大门也是有隔音效果的，这样对工作细节的掌控让人敬佩。京都站的小店装修，也会写明周几休息，周几工作的字样，估计已经是日本全国约定俗称的规定了，可以说这是一个高度程序化的国家，大家都遵守规矩，可以带来很多便利性。 清水寺 花见小路 二条城二条城是德川家康的府邸，门票成人600日元，外部是白墙，建筑内部不允许拍照，进入要脱鞋，内部环境给人以肃穆宁静的感觉。过道的地板，踏上去会发出鸟鸣般的声响，据说是警示有人入侵的作用。开个玩笑，在里面走着，会不会不小心碰到什么暗道机关，来个万箭齐发：） 锦市场看了外国人常乐在锦市场的视频，所以决定一定要去看下，找到了那家可以生吃海产品的店铺，吃了点生的金枪鱼，建议对生的海产品不适应的朋友，可以少吃一点，否则可能会导致腹泻。锦市场里的烤生蚝，平均价格比魔都要贵上三倍，1000日元，魔都的饭店单卖的烤生蚝里要12元以上一个，没有锦市场的生蚝大。生金枪鱼算是比较实惠的海鲜，500日元一份，烤扇贝，3个一串，500日元，推荐尝试下。如果对食材有特殊喜好的，可以尝试下海胆和河豚。 奈良市奈良公园去奈良主要就是喂奈良公园的小鹿，公交车可以直接开进去，不需要门票。值得一提的是，日本的公交车后门是自动的拉门，前门和国内一样，是折叠式，京都是从后门上车，奈良是从前门上车，走的时候到前门下，投硬币或刷企鹅卡即可。京都的公交，如果前门下车的人很多，司机还会控制后门先不开启，不让乘客上来，等车内乘客都下的差不多了，才开启后门，以保证车内的秩序，给点个赞。还有就是日本的公交车上，几乎每个位置边上都有红色的按钮，如果你需要在两站之间下车，直接按按钮，司机就会缓缓的为你停车（有没有一种休闲的感觉）。喂鹿需要买鹿饼，150元一包，圆圆的，大概有10个，闻上去很香，记得买完不要把饼放在明面儿上让鹿看到，不然附近的它们会开始“围攻”你，所以最好是离鹿群远一些。除了一些长角的雄鹿“不太友好”之外，大部分的鹿都很有礼貌，博主找了一只“有礼貌”的小鹿，单独喂，喂之前它不断的点头“鞠躬”，真是可爱。到了奈良千万不要错过和小鹿们近距离接触的机会，这和在动物园里隔着铁笼的体验是不一样的。 大阪市环球影城周六到达环球影城，来之前在淘宝上买好门票，和迪士尼一样，环球影城也有快速通行证，于是买了四项标准版的 快速券，打印出来带在身上，在每个项目入口找到Express Pass字样，给工作人员扫下纸上的二维码即可。博主主要用在了小黄人调皮闹剧乘车游、哈利波特禁忌之旅这两个项目，其余项目除了蜘蛛侠排队稍微长些，快速券能起点用处，而魔鬼终结者和浴火赤子情，基本不需要用快速券。 小黄人乘车游的转动幅度不大，不容易晕，适合小朋友们。哈利波特禁忌之旅全程速度和转动幅度偏大，很惊险，不时会听到周围人尖叫。需要注意下，快速券有限定时间，不过博主提早进入哈利波特禁忌之旅也被允许了。而小黄人乘车游的规定时间，票上写的是下午2点40分，就必须按时进入，过期作废。环球影城几个热门的项目都是4D，会有温度和水的体验，很有趣。魔鬼终结者和浴火赤子情，等待的会久一些，不过精彩的表演会让人觉得等待是值得的。 环球影城的饮食，博主买了个火鸡腿，1000日元，后来在另外一家摊位发现有980日元的火鸡腿。魔都迪士尼的火鸡腿目前是80元。天热，点个芒果雪糕是不错的选择，价格是500日元。 乐园里的工作人员都很热情，会和你进行互动，比如在游玩时会和你招手，游玩结束时双手和你击掌。很多工作人员待人接物的时候一直在微笑，如果不是发自内心，是无法将笑容保持这么久的。 晚上8点多，乐园里还有奇观夜间游行。工作人员会在人群之间用绳索设置好通道，人群不挤，不用刻意站到最前排也能看到表演的全貌。 回程6月18号早上，博主醒来没多久，感觉到酒店大楼前后明显晃动，当时同楼层的人都觉得是地震发生，已经开始有人走出房门往地面上走了。这个酒店防震很好，内部没有什么损失，只是电梯都停了，必须通过楼梯走下去。迅速从15楼下去走到酒店2楼大厅，得知地震是5.9级，问了下酒店前台，大阪所有的地铁都已经停运，而且酒店去机场的巴士也停了！打电话给航空公司，得知飞机会正常起飞。这种时刻，酒店的员工遇到顾客还是坚持微笑服务，真的是佩服他们的精神，给人带来很多温暖。因为飞机是下午，上午还有些时间，博主先去了心斋桥逛了一会儿，这里秩序井然，完全没有发生过地震的样子，只是一些店铺的员工因为地铁停运，住得远，没法赶过来。再回到酒店大厅，休息了一会儿，喝了些2楼大厅提供的橙汁，想了想还是先回去洗漱，收拾好行李，看能不能打出租车去机场。刚准备排队等出租车，酒店的工作人员看到博主手上拿着机场巴士的票，提醒博主去退票。等重新回到酒店2楼，好消息传了出来，难波地区的南海特急开通了，就这样，博主欢快的拎上行李，走向难波地区，坐上南海特急抵达了机场，启程返回魔都，有惊无险的结束了这次关西之旅。","categories":[{"name":"travel","slug":"travel","permalink":"https://www.easonx.cn/categories/travel/"}],"tags":[{"name":"旅游","slug":"旅游","permalink":"https://www.easonx.cn/tags/%E6%97%85%E6%B8%B8/"},{"name":"日本","slug":"日本","permalink":"https://www.easonx.cn/tags/%E6%97%A5%E6%9C%AC/"},{"name":"关西","slug":"关西","permalink":"https://www.easonx.cn/tags/%E5%85%B3%E8%A5%BF/"},{"name":"奈良","slug":"奈良","permalink":"https://www.easonx.cn/tags/%E5%A5%88%E8%89%AF/"},{"name":"京都","slug":"京都","permalink":"https://www.easonx.cn/tags/%E4%BA%AC%E9%83%BD/"},{"name":"大阪","slug":"大阪","permalink":"https://www.easonx.cn/tags/%E5%A4%A7%E9%98%AA/"}]},{"title":"股票投资最重要的核心是什么","slug":"2018-06-08-the-core-of-stock","date":"2018-06-07T16:00:00.000Z","updated":"2020-07-08T11:05:21.573Z","comments":true,"path":"2018/06/08/2018-06-08-the-core-of-stock/","link":"","permalink":"https://www.easonx.cn/2018/06/08/2018-06-08-the-core-of-stock/","excerpt":"下周博主准备出游日本，这三个月跌跌撞撞，股票投资总体盈利，但还有很多进步空间。去旅游的时候就停止投资，以休息为主。所以有必要在年中的时刻进行总结，减少操作的缺陷，规避风险，为长期稳定盈利做打算。从2011年开户到现在，做了这么久，股票投资的核心在自己看来是什么，我认为不是打听各种消息和新闻，也不是研究公司的财务和基本面，甚至不是抓涨停的神乎其神的技术。而是要看懂K线表达的含义，和机构保持同一个节奏操作。","text":"下周博主准备出游日本，这三个月跌跌撞撞，股票投资总体盈利，但还有很多进步空间。去旅游的时候就停止投资，以休息为主。所以有必要在年中的时刻进行总结，减少操作的缺陷，规避风险，为长期稳定盈利做打算。从2011年开户到现在，做了这么久，股票投资的核心在自己看来是什么，我认为不是打听各种消息和新闻，也不是研究公司的财务和基本面，甚至不是抓涨停的神乎其神的技术。而是要看懂K线表达的含义，和机构保持同一个节奏操作。 要保持固定的操作模式和节奏，可使用下面总结的定式： 当站上日线的重心位（也就是七天移动平均线，也可使用八天均线，后面简称七均线）的阳线买入信号出现后=》 第二个交易日等待回抽七均线的价格后买入（可使用交易软件挂单，不推荐人工操作，可以克服人的弱点） =》买入后有三种情况 1.当天跌破买入价位，也就是比重心位还要低。则第三个交易日挂单买入价格，平盘或微盈卖出，此种情况一般都能成交，规避短期的风险。Ps. 细心的朋友可以想一下为什么要这么做 2.当天收盘在重心位之上。我们坐看风起云涌，继续持有。 3.第三个交易日开盘明显的跳空低开，同时跌破重心位。操作上类似第一种情况，立刻挂单买入价格，平盘或微盈卖出，此时第三个交易日经常会出现长上影线。Ps. 对没错，长上影线，涨过缺口位置后又跌破缺口 =》当买入后一直在重心位之上，恭喜你，可以一直持有到失去重心后再卖出，完成一个操作轮次。 以上包括很多股票买入、卖出、持有的过程，大体不会差太多。但是，不包括空仓。 空仓在股票的四象（买入、持有、卖出、空仓）里占四分之一，但是时间上来说可能至少占据三分之一以上甚至一半以上的时间，所以，只要把空仓的时机选择好，基本上投资已经成功了一大半，它的反面是满仓，能满仓找到市场上最强的股票，则是对自己更上一层楼的要求。","categories":[{"name":"invest","slug":"invest","permalink":"https://www.easonx.cn/categories/invest/"}],"tags":[{"name":"投资","slug":"投资","permalink":"https://www.easonx.cn/tags/%E6%8A%95%E8%B5%84/"},{"name":"股票","slug":"股票","permalink":"https://www.easonx.cn/tags/%E8%82%A1%E7%A5%A8/"}]},{"title":"回转心力","slug":"2018-02-17-new-year-2018","date":"2018-02-16T16:00:00.000Z","updated":"2020-07-08T11:05:18.129Z","comments":true,"path":"2018/02/17/2018-02-17-new-year-2018/","link":"","permalink":"https://www.easonx.cn/2018/02/17/2018-02-17-new-year-2018/","excerpt":"上周六参加了上座部禅修的活动，和刚刚认识的贤友一起静坐，一天就坐了4个小时，是目前我静坐时间最长的一天，通过体悟而得到了收获。博主最近一年就研究和静坐有关的事情，希望能给自己的身心带来改变，打坐了100多个小时后，觉得有很多感想需要和旁人交流，于是找到了这个修行的组织。","text":"上周六参加了上座部禅修的活动，和刚刚认识的贤友一起静坐，一天就坐了4个小时，是目前我静坐时间最长的一天，通过体悟而得到了收获。博主最近一年就研究和静坐有关的事情，希望能给自己的身心带来改变，打坐了100多个小时后，觉得有很多感想需要和旁人交流，于是找到了这个修行的组织。 对于禅定、唯识，我看了很多南公南怀瑾的书，理论似乎懂了不少，但是都停留在圣言量的阶段，自己只有一些初步入门的实修经验，靠着自己每天参悟所得，再结合静坐，身体有了几次微妙的反应，有反应自然说明有一些成果，从南怀瑾的观点来看，不能执着于身上的反应，这些是静坐后水到渠成产生的结果，如果一开始就拼命追求气脉、脉轮这些“有为”法，是倒果为因。 现在我的感觉，气机在每次静坐持续一段时间后，会自然开始流动，但是出现频率也不是必现的，而是偶发。而位置每次都在我左侧锁骨的位置，横向左右流动。而持续了一段时间后会消失，随后督脉附近会发热，锁骨和三角肌的环状一圈也会发热，很殊胜的感觉，要说完全对此不执着，目前我还达不到，人的心理就是这样，一个好的东西曾经出现，下次就会想为什么它不来了。而气机流动的原因，以我目前的思考所得，应是体内的温度发生了不平衡，就像风的产生是因为冷暖空气相遇，静坐会将热能聚集在中脉附近，离中脉越远，温度相对越低。而肩部有提供气机流动的空间，又有温差（温差的产生可能和病灶有关），所以会在体内产生此感觉。 最近估计因为静坐，于偶然处get一个技能，博主经常去电影院看电影，再加上平常会在电视上看电视剧，看到各个国内外演员，有心无心的会记住他们的长相。去年看电影《异形：契约》，对影片的演员和传达的理念留下了非常深刻的印象，而在看完后过了一段时间，记得好像是睡觉起床后，突然我的脑海中浮现了《异形》中大卫扮演者的形象，好像他是电影《X战警：天启》里的万磁王，我立刻打开淘票票客户端搜索印证，果然是一个人，没错！这两部电影我都是上映后第一时间去看的，《异形》的放映要比《X战警》晚将近一年，而在看完《异形》后，我根本没有思考过两部电影间演员的任何关联。相当于从起疑情到悟，几乎是一瞬间完成，问题在提出时就已经解决。而第二次相同的情况发生在今天，早上刚起床，正努力回想晚上睡觉时出现的梦境，突然冒出一个念头，想到最近热播的电视剧《和平饭店》里王大顶媳妇的扮演者，好像演过电影《心花路放》的那个女阿凡达，去网上搜索印证，确实是同一个人。这两部作品相隔了3年，我期间也没有思考过它们之间的联系，现在又是以这种方式回想起来。这让我不得不重新思考，人的思维方式有时候真不是完全由自己控制，也许有时候它会像植物一样，有自动生长的属性，会填补认知的空白，而当空白被填补的时候，就会发生我们解释不了的思维现象。而最容易产生这种情况的时间，是人在极静之后，思维开始运转的时候，这又是不是《易经》中所说一阳生的时候呢？ 这大概就是禅宗所经常提到的顿悟吧，顿悟是一种灵感，它不会经常出现，但是一出现你的内心绝对会有深刻的认识。我们可以左右看得见摸得到的很多东西，但是我们的心流是难以把握的。吾等学佛之人须认真打坐、参禅，不应执着苛求太多，或许，在不经意之间，你会豁然发现一片蓝天。","categories":[{"name":"tradition","slug":"tradition","permalink":"https://www.easonx.cn/categories/tradition/"}],"tags":[{"name":"顿悟","slug":"顿悟","permalink":"https://www.easonx.cn/tags/%E9%A1%BF%E6%82%9F/"},{"name":"禅修","slug":"禅修","permalink":"https://www.easonx.cn/tags/%E7%A6%85%E4%BF%AE/"}]},{"title":"关于股票(贰)","slug":"2017-04-09-about-stock2","date":"2017-04-08T16:00:00.000Z","updated":"2020-07-08T11:05:14.377Z","comments":true,"path":"2017/04/09/2017-04-09-about-stock2/","link":"","permalink":"https://www.easonx.cn/2017/04/09/2017-04-09-about-stock2/","excerpt":"拿正在操作的股票–中信重工说道说道，逐步往重点方向（越往后越重要）讲 从2015年到现在，基本和大盘保持同步（随动大盘）。 2015年5月29日涨到最高点，随后6月16号跌破颈线位一路下跌。","text":"拿正在操作的股票–中信重工说道说道，逐步往重点方向（越往后越重要）讲 从2015年到现在，基本和大盘保持同步（随动大盘）。 2015年5月29日涨到最高点，随后6月16号跌破颈线位一路下跌。 2016年1月份到4月份，形成双底，随后逐渐横盘，收集筹码，一直没有比较大的涨幅。即使4月份有4个涨停板，但是没有扭转下跌趋势 后续2016年4月份之后，再也没有跌回到5元以下，到如今2017年4月份，始终围绕着 89天均线（凤线） 调整，并逐渐将凤线由下跌趋势拉平转为上升趋势。 2017年3月份，中信重工的走势强于大盘（如果不想找3月的头和尾，可以切换到月线，明显看到大盘3月收小阴线，中信重工收小阳线）。 2017年3月8日到16日形成的K线，围绕7天均线（虎线）形成了双底，颈线位是3月14日最高点5.62，并且站上虎线，买入信号出现【图2】。 随后几天的上上下下，3月23日振幅非常大，跌破了凤线，收盘受到虎线和凤线的支撑，拉了回来，但是最低点5.55没有跌破3月16日标志性K线的最低点5.53，当天回抽虎线、甚至回抽凤线都可以买入。 从3月16日买入信号出现到3月底，中信重工走势强于大盘，持有。 本周三天大盘强势上涨，中信重工这三天弱于大盘，收阴线。所以4月份走势非常重要，继续跟踪。","categories":[{"name":"invest","slug":"invest","permalink":"https://www.easonx.cn/categories/invest/"}],"tags":[{"name":"投资","slug":"投资","permalink":"https://www.easonx.cn/tags/%E6%8A%95%E8%B5%84/"},{"name":"股票","slug":"股票","permalink":"https://www.easonx.cn/tags/%E8%82%A1%E7%A5%A8/"}]},{"title":"关于股票(壹)","slug":"2017-03-03-about-stock","date":"2017-03-02T16:00:00.000Z","updated":"2020-07-08T11:05:10.709Z","comments":true,"path":"2017/03/03/2017-03-03-about-stock/","link":"","permalink":"https://www.easonx.cn/2017/03/03/2017-03-03-about-stock/","excerpt":"博主2011年入市，到现在也有将近6年了，将这些年的理解，做以下总结，不定期会在博客里更新： 1.实战都不需要预测，高手有固定的操作模式，动力定型；预测分析是操作的对立面 2.一个月操作一次强势股，远比频繁交易弱于大盘或随动大盘的个股要好，操作要精而简","text":"博主2011年入市，到现在也有将近6年了，将这些年的理解，做以下总结，不定期会在博客里更新： 1.实战都不需要预测，高手有固定的操作模式，动力定型；预测分析是操作的对立面 2.一个月操作一次强势股，远比频繁交易弱于大盘或随动大盘的个股要好，操作要精而简 3.股票有周期概念，不同周期的操作频率和持续时间有区分。从李菲老师那里学到有分时、日线、中期三种，分时最短，中期最长。所以在评论某个股票什么时候该买该卖，如果没有加上周期的概念，都是错误的。一般我操作日线和中期仓位，不做分时。目前我比较熟悉日线和分时的区分，对于个股中期行情不是特别清楚 4.易经中一半的思想，结合K线形成的语言，对比大盘，可以对个股进行定性，也就是强弱和当前的状态(买入、持有、卖出、空仓 四象)。 5.触类旁通，股市的功夫在股市外 6.股市是军事思想的集中体现，所以策略(战略)&gt; 技术(战术)。如果没有看清楚，空仓(大动不如小动，小动不如不动–太极拳思想)都比行动好 7.指标也是根据高开低收等股票要素计算而来，大道至简，操作不如直接看K线(古代叫罫(guà)线) 8.看盘用多条均线不如少用，我只用7天和89天，7天对应短期日线行情，89天对应较长的中期行情 9.多账户操作同一只股票 10.右侧交易(出现阳线甚至大于4%阳线之后)才执行买入，比左侧交易(暴跌等连续出现阴线的最后阶段)要稳，因为我的系统里认为买入信号只能是阳线决定","categories":[{"name":"invest","slug":"invest","permalink":"https://www.easonx.cn/categories/invest/"}],"tags":[{"name":"投资","slug":"投资","permalink":"https://www.easonx.cn/tags/%E6%8A%95%E8%B5%84/"},{"name":"股票","slug":"股票","permalink":"https://www.easonx.cn/tags/%E8%82%A1%E7%A5%A8/"}]},{"title":"【转】道教修炼秘传手印与盘腿法及退符法","slug":"2017-03-02-tao-gesture","date":"2017-03-01T16:00:00.000Z","updated":"2020-07-08T11:05:00.545Z","comments":true,"path":"2017/03/02/2017-03-02-tao-gesture/","link":"","permalink":"https://www.easonx.cn/2017/03/02/2017-03-02-tao-gesture/","excerpt":"清阳子（即田诚阳）按：由于不断有些网站读者，发来电子邮件，请教掐诀的具体做法，特由巴塞罗那清静宫，撰文加以阐释。 当今许多人学习道教静坐，但是往往苦于念头难除，及无法得气，其实这与静坐时的手印要诀，存在极大关系。倘若得法，则易收到事半功倍的效果。由于道教修炼的手印，自古以来都在师徒间秘密传授，因而世人罕知。为了使大家不再疑惑，现在打破框框，将其中要诀，详细公开于此。","text":"清阳子（即田诚阳）按：由于不断有些网站读者，发来电子邮件，请教掐诀的具体做法，特由巴塞罗那清静宫，撰文加以阐释。 当今许多人学习道教静坐，但是往往苦于念头难除，及无法得气，其实这与静坐时的手印要诀，存在极大关系。倘若得法，则易收到事半功倍的效果。由于道教修炼的手印，自古以来都在师徒间秘密传授，因而世人罕知。为了使大家不再疑惑，现在打破框框，将其中要诀，详细公开于此。修炼时双手结印，道教称为“掐诀”，又称“抱诀”或“抱印”。修炼手印，在道教内部称为“太极阴阳八卦连环诀”，又称“太极诀”或“太极印”。具体做法是：两手掐诀之时，男子以左手虎口，抱右手四指（女子右手虎口，抱左手四指。因为男子左手为阳，女子右手为阳，故以阳手居外，而阴手居内），而以右手虎口，抱左手大指（女子以左手虎口，抱右手大指）。同时，两手大指梢，各自接触另一手心的劳宫穴（在手心正中凹陷处）。这样两手拇指在虎口形成“太极图”形状（大指相互在另手的手心，就是太极图的两个眼睛，用来接通自身阴阳二气），其余四指代表“八卦”，两手一阴一阳，故此称为“太极阴阳八卦连环诀”。如是阳手护阴手，阴手抱阳手，即是《道德经》“负阴抱阳”之义。两手合在一起，就象接通了电源的正负极，阴阳二气自然接通。而且阴阳结合之后，马上就会形成一个封闭的气场，心情自然平静下来，两手迅速感到发热发胀，奇妙无比。如此心自然静，念自然停，身自然安，气自然行，对于静坐修炼有不可思议的效果。不惟如此，即在平常工作和生活之中，如果有片刻清闲，或者在地铁和乘公共汽车之时，两手结印，平静养神，亦常常出现神奇的效果。但是坐车的时候要注意，不要因为入静，而坐过了站。盘腿的方法，一般人认为“五心朝天”的坐姿最好，其实这种方法的最大作用，在于稳固不倒，坐三天、五天甚至一个月，都不会倒。但是一般人，如果不是专门修炼或者闭关，没有必要强制自己，把两条腿压得生疼，来学习这种坐式，不光难以入静，弄不好容易把韧带拉伤，反而多走弯路。盘腿的目的是为了修炼，而修炼不是为了盘腿。所以我们提倡自然的方法，两条腿可以单盘（即一条腿压在另一条腿上），也可以便盘（即两腿交叉），盘坐困难者可先在座下垫个枕头；如果盘腿太痛苦，也可以平坐凳上，小腿垂直于地面，或者交叉亦可。但是无论如何盘腿，都要注意手和脚是相反的。即男子结印左手在外，而盘腿时右腿在外；女子则相反，结印时右手在外，盘腿时左腿在外。女子丹法，亦有专门的“跨鹤坐”式，亦遵此原则。退符法，一般人也称为收功，请参看《修道入门》或《中华道家修炼学》中关于吐纳一节的讲述。或问道教修炼与佛教禅定的手印，有何不同？佛教禅定印是佛陀入定时所结的手印，又称为法界定印，即两手心向上（右手背平放于左手掌上），两个大拇指轻轻相拄。禅宗偏重于修性，所以这一手印，使人较易进入静态。而道家是性命双修，所以修炼所用的太极印，不光是容易入静，更加能够连通人身阴阳二气，使其自然运行，因此会比较容易得到气的感觉，有利于补充人体精气神，并与天地之气合为一体。 结印手式，可以参照下图： 静功法诀－－田诚阳 道教修炼学 — 静功法诀 静功的内在法诀 (1)听息 静功的目的，在于入静。入静的含义，就是指身心安静下来。为了达到入静的要求，首先必须去除一切杂念，这是静功筑基法最为关键的一大原则。 但是人们的思想习惯，大脑总是在不停地考虑问题，即使睡觉也会做梦，要它一旦停止不动，很难做到。为了达到入静的目的，古代道家修士创立了许多法门，如听息、坐忘、守一、数息等等。比较起来，以道教庄子所讲“心斋”之中，谈到的“听息”法为最好。 所谓“听息”，就是听自己的呼吸之气。前面我们说了，静功要求自然呼吸。听息的方法，就是两耳内听，即屏除外界一切干扰，如入万籁俱寂之境，去听自己的呼吸之气。初步 入手只用耳听，不加任何意念。 注意：所谓“听息”，要求两耳返听于内，好象是听呼吸出入之声。但是呼吸出入，本来要求无声。所言“听息”的意思，是求其凝神内注，专心养静；并非死死去守耳窍，也不是去听呼吸的声音。“听”的意思，就是为了精神集中的意思，只要随着一呼一吸的路线，慢慢似听非听的去做，这就算是对了。至于呼吸的快慢、粗细、深浅、长短，都要顺其自然变化，不要用意念去强行支配。 听到后来，心息相依，杂念全无，连呼吸也似乎不存在了，逐渐也就到达“入静”的境界。 (2)观光 “观光”之法，是道家秘传的修炼法门，从前秘而不授，皆为师徒相传。观光的作用，就是为了炼性。吾人之性，原为虚空一光，在下生之前，来自宇宙。因此这是炼性的根本方法，谓之性功。有人以为道家所讲的“性”功就是道理，没有功夫，是未得明师传授性功之故。 性之根，在于两目中间之一窍。此窍来自吾人下生之前，因而称为“祖窍”。初先静坐片刻，用前面所讲的“听息”法。身心入静之后，即将两目之光收回，似观非观，止于祖窍之前。这个“祖窍之前”，不在身内，亦不离身外，就在眼前约一寸二分的位置。注意：所讲“观祖窍”之法，是为了聚起自己的元性。元性聚起，自然就会见光。但是这个境界是自然的，万万不可追求；如果追求，也会见光，但为幻境，非为真性。许多炼气功的人士，往往就在这里进入魔境，不自觉察，真是差之毫厘，失之千里。须要用“若有若无，似看非看”的意思，在无意有意之间，不可着意，又不可无意。自然而然，这就对了。 心神微微放于祖窍，就可能出现自已的性光。初则点点，飘移不定，其光微弱，不要管他；开始似乎由外而来，出现之后，此时以心神稍微照摄之，凝定之，即以真意照于白光中，此为聚性之功；继之由点而渐渐凝聚成片，片片而来，由外归内，慢慢聚起；再继之则时聚时散，难以固定；如是则最后终于成为一片，而无波动，如此真性渐聚矣，而吾人已入大静。光是性的表现，观光即知自性的聚散。光散性即散，光聚性即聚，光定性即定，光满性即满，光圆性即圆。王重阳祖师当初描摹其圆满形状曰：“圆陀陀，光灼灼。”圆者，是言其没有不规则的形状，灼者，是言其没有黑色的漏洞，这样才能到达“性光圆满”的最高境界。进入这一境界，生死可以自主。但是如果不是深入大定，而且具备极高功德，就不可能达到。 观光的功夫，虽用“观”法，而其实不是在观，一切都是自然而然。修炼此功，须循序渐进，由光小而至光大，由光弱而至光强，从波动而至光定，从片片而至光聚。亦有人修炼多日，两眼漆黑，而从未见光，故不可追求。 注意：以上所言，“听息”与“观光”之道。虽似有为，其实无为；无为之中，无所不为。虽曰听息，其实无听；虽曰观光，其实无观。听息无息，息听于无；观光无光，光观于无。无息之息，谓之真炁；无光之光，谓之真性。由此参悟，方入真道。 道教修炼学的阶次－－田诚阳 道教修炼学的阶次 中华丹道修炼，包括筑基炼己、炼精化炁、炼炁化神、炼神还虚、炼虚合道等五层阶次。 下面作以简要介绍： 一、筑基炼己 筑基炼己阶段，天元丹法称为“筑基”，人元丹法称为“炼己”，其实均为筑基之义。此步功夫如同盖房子打地基的阶段，是一切修炼的基础工作。筑基的程度越深，往上修炼的层次也就越高。此步功夫的方法一般包括止念、入静、聚性、回光、独立、调息、吐纳、咽津、导引等等，因为老师传授不同而略有差异。筑基的作用是为了补足精炁神三宝之亏损，为修炼内丹作好药物方面的准备工作。可以初步达到祛病健体、调和身心、延年益寿之效果，享受现实的人生。 二、炼精化炁 炼精化炁，是将自身元精化为阳炁，通过周天火候运行任督二脉，采入丹田，使得神炁合一，又称“小周天”。采炼日久，可以炼丹。此步功夫主要针对中老年人说法，补足后天亏损，达到返老还童、恢复青春的目的。 三、炼炁化神 炼炁化神，是在返还童体之后，周身关窍进一步打开，经脉俱通，又称为“大周天”。此时人身之炁进一步与天地之炁相合，天人感应，而后采取太虚中先天之一炁，配合自己元神而修炼之。使得神炁抟结，结胎于中下二田之间，和合凝集，以养大丹。丹书云：“金丹一粒吞入腹，始知我命不由天。”此时阳神成就，可证肉体长生。性命合一，进入混沌，如同胞胎婴儿，称为返老还童。 四、炼神还虚 经过炼精化炁的阶段之后，即由肉体修炼(又称仙功)转入精神修炼(又称道功)，进一步涵养自己阳神，使其归于虚无，又谓之“真空炼形”。是为返童还婴。此步功夫，可以达到阳神出窍，谓之“出神”。 五、炼虚合道 炼虚合道，又称“粉碎虚空”。进一步将先天虚无之阳神，合于遍布万化、无所不在之大道，出现“百千万亿化身”。即《庄子》所云：“上与宇宙同体”是也。此时形神俱妙，与道合真，可谓返虚合道，功成道备。静功止念法－－田诚阳 静功的关键，在于入静；入静的关键，在于止念。止念就是去除心中的杂念，然后一心一意地去做静功。往往有的人，平时不觉自己脑海之中存有杂念，及至静坐之时，什么念头都来了。只有通过静功止念之法，去除杂念，才可能把静功做好。止念之法，可以分为两种情况讲述：1、平时如何止念我们所讲的修炼法，是一个广义的概念，这和一个的日常的生活密不可分，即一天二十四个小时都可以进行修炼联系在一起，当然收益最大。相反，如果一个专门静坐之时一本正以，下坐之后又去胡思乱想或者大动肝火，不光静坐得到的益处就此赔个一干二净，再去炼功肯定也不会炼好。所以，一个人的炼功生活和日常生活密不可分。要想把止念的功夫炼好，就要在日常生活之中注意修心、修性、修德、修念。对于在外部环境之中，平时如何才能做到修养心性？自己内部的心态修养，如何才能保持开阔的胸怀和豁达的人生观？这一方面，道家的处世哲学和为人之道为我们提供了良好的借鉴。为此，笔者在此讲述道家的三项准则：（1）欲正人，先正已；欲人敬，先敬人。为了处理好人际关系，保障个人的功修，着先必须严格要求自己，从我做起。这句话的意思是说：想要修正别人，首先就应当修正自己让别人接受；想让别人尊重自己，自己首先应当尊重别人。这样一种推已及人的人生观，并非是一种软弱无能的表现，也不是一种自贱自卑的消极态度，而是表现也一种发自内心的旷达胸怀，以道德心，文明待人。以便排除一切外来干扰，精进修持自己的功夫。那么，如果修正不了别人，也没有必要生气上火，相反正是修正自己的良好契机。这种事情本身，就是对于静功修持者的一种考验。只有在实际生活之中不断磨炼心性，才能逐渐增益自己的功修。古人云：“大隐居尘”、“何必深山守静孤”，就是这个道理。（2）事情则应，事过则忘。人生在世，每天都有许多事情要做，那么，如何才能保持内心的平静呢？就是要在事情来了之后，应当不慌不忙地坦然去做，并且尽量争取做得圆满无缺，这样心中就不会留下遗憾。同时，在做一件事情的时候，就不要去考虑其他的事情，如果背着其他的负担去做一件事情，就不一定能把这件事情做好，也许节外生枝，反而更加增添了另外的麻烦，同时也扰乱了内心世界的平静。事情完成之后，有了空闲，就把这件事情彻底忘掉，心中不留任何负担，就象没有发生这件事情一样。这样事后无心，即可心中无事，思想上没有负担，杂念也就同时跟着减少，无形之中功修随之精进。（3）得之不喜，失之不忧。一般人的心理，自己得到什么就会欢天喜地，自己失去什么反而烦恼忧伤，自己的心成了外界事物的奴隶，不能自已做主，可是自己又不觉察。修炼的人，内心的境界高尚，一尘不染，万虑皆空，不以物喜，不以已悲。所谓：“祸福无门，惟人自召”。一般所自己认为的得与失、祸与福，其实都是自己心中想的，掩盖了自己的本性真心。而且二者之间的关系并不绝对，可以相互转化，老子云：“祸兮福之所倚，福兮祸之所伏。”中国古代有“塞翁失马”的典故，说是边塞有位老人，他的一匹马丢了，邻居很替他着急，他却不以为然地说：“也许这是一件好事。”后来这匹马自动回家了，并且带来一匹马，邻居又向他祝贺，他却不以为然地说：“也许这不是一件好事。”后来他的儿子骑这匹马把腿断了，邻居又替他难过，他却不能为然地说：“也许这不是一件坏事。”后来边疆征兵上前线，他的儿子由于摔断了腿，就没有被拉去当炮灰，这个故事说明了“祸福无常”的道理，得到了也不一定就是失去了也不一定会是坏事，得与失都不是固定不变的，关键是身心不应当为外界事物所役使。对于修炼的人来说，应当跳出世俗圈子，不为外称所动，以保持身心清静，增益功修。从以上所述几点可知，道家修炼与流行气功不同，修炼首先要求人们应当做一个有道德的人，做一个高尚的人，也可以说是首先要做一个好人，先尽人道，再修仙道。修炼有着严格的道德标准，即人道为丹道之基，无德则不能培道，这一根基，决定了道家丹法修炼的现实性与真实性，仙道贵实，绝非空谈。这与宗教家的神权迷信和玄学家的口头空谈大异其趣，不可同日而语。2、静功如何止念初做静功，杂念纷扰，这种情况对一般人而言，都是不可避免的现象，因为心中有念，早已成为人们的一种心理惯性。以至于有错误地认为，心中无念的境界根本不可能达到。其实平时不觉得心中有念，乃至做功之时始觉念头搅扰，这已经是心中初步进入静态的一种标志，因为惟其心中有静，才能体会到念头之动。那么，对于这些起伏不定的念头如何处理，才能达到一念不生的入静状态？据笔者的经验，这里讲述几种道家修炼所用的办法：（1）有念即止静坐之中，始终保持警惕，如有杂念生出，随即除去，这样使前念消除，后念不生，当下无念，即是清静。或者有的念头，是个需要考虑的问题，比如明天要不要去做一件事情，那么可以考虑一下，有了结果马上停止。这样心中不抱负担，停止这后一般不会再来。倘若还有其他事情需要考虑，仍用这个办法解决之。实在考虑不好的问题，就先放下再说，不必苦思冥想，耽误做功。这样逐渐减少，自然达到无念的地步。老子《道德经》曰：损之又损，以至于无为。损者减少之意，无念即无为境界。这种做法的好处，比较便于掌握。就怕杂念太多，脑子不断地思考问题，此起彼伏，按下葫芦又起瓢，弄得不可招架，一旦急躁，杂念更多。所以还不算是上善的方法，但在一般人可以试行，短时间内能够起到一定的作用。（2）收回忘掉这种方法，属于心法，需要有点司性才能做到。静坐之时如有杂念，即用微意归身内，然后忘悼，一忘而杂念自无。可以想象自身如同大冶洪炉，熔化一切物我念想，所有杂念如似雪花片片，入炉即为消熔。这样杂念生出，即收归身内，“忘”了之后，化为乌有。遂生遂收，遂收遂忘。渐渐导心入静，自臻清静无为之妙境。为什么说修炼需要悟性，这个“忘”字需要“悟”（领会）了才能做到。所谓“忘”，非是一般人什么都不知道的傻忘，乃是对于自性心性层次的一调节，即由杂念丛生的心境，移入一念不存的静地。马丹阳祖师曾言：“无心者，非同猫狗蠢然无心也。务在存心于清静之域，耐我邪心也。故俗人无清静之心，道人无尘垢之心，非所谓俱无心而与木石同也。”此中“无心”即“忘”之本义，“邪心”即邪忘之心，可见“忘”字，非猫狗蠢然之忘，亦非俗人无心之忘，乃是修炼所要深入所要深入的一种境界。以“忘”的境界来行持入静，这是道家内丹独有的心法。（3）顺其自然这种方法，是一种易简法门，即不加任何意念，自然入静。假若浮游乱想，萦绕心怀，虽然杂念不重，但是暗里许多，一时分辨不清，如同乱丝无头，用“有念即止”法难以清理，用“收回忘悼”法难以控制。这时就不用管他，只须自己静坐不动，顺其自然，听其自生自灭。只要自心将其置之不理，这些杂念也就成为“假想”，因为念自心生，心中静坐不理，杂念失去市场，也就无奈我何，只有仍归自心，化为静念。在做功夫中只要身体稳坐不动，任他杂念自动起伏，经过一段时间的“假想”之后，杂念自然也就慢慢地平息下去，而自然归于清境。中间猛然一觉，杂念全消，此时身心自静，舒畅难言。就象不听话孩子，淘气玩耍，大人劝其回家安份，反而和大人较劲，这时索性不去管他，等他玩累玩乏之后，无处可去，不用劝说，自然乖乖地回家了。这种顺其自然的办法，有一点须要注意，倘系恶念，必须马上用第一种办法除掉，决不姑息，否则其害更烈。以上三种办法，以最末一种办法为上善之法，第二种办法为中善之示。因为做功夫的时候，杂念纷扰，已经够人厌烦，再加上去除念这个心念，又是一个念头。譬如两个人在那里吵架，已经闹得不可开交，难分难解，旁边又添上一个强制劝和的人，三个人闹成一团，如何能够解决问题？劝和原是好意，总要等他们二人火气将消，再用巧妙的手段打动人心，则一劝自然平息。如果劳神费力，强迫压制，手段未免太拙。但是这些用法者要因势利导如果两人争吵激烈，非用强迫不可制止，也未必不可强制使之平息。比较起来，上述的三种方法，第一种“有念即止”，属于意念法；第三种“顺其自然”，属于无意法，我们练习止念入静的功夫，当然以不动意念（或微用意念）者为优。故以第一法为下善。根据实际情况，可以相互配合使用。","categories":[{"name":"tradition","slug":"tradition","permalink":"https://www.easonx.cn/categories/tradition/"}],"tags":[{"name":"静坐","slug":"静坐","permalink":"https://www.easonx.cn/tags/%E9%9D%99%E5%9D%90/"},{"name":"道教","slug":"道教","permalink":"https://www.easonx.cn/tags/%E9%81%93%E6%95%99/"}]},{"title":"第一篇","slug":"2017-02-11-newcome","date":"2017-02-10T16:00:00.000Z","updated":"2020-07-10T02:30:36.045Z","comments":true,"path":"2017/02/11/2017-02-11-newcome/","link":"","permalink":"https://www.easonx.cn/2017/02/11/2017-02-11-newcome/","excerpt":"本人是魔都的一名攻城狮，浑浑噩噩工作了有八年时间，写了很多代码，但好像没有觉得多有成就感，反而觉得这不是追求所在，很喜欢研究传统文化、股票投资，工作之余自得其乐，现在流行自建博客，也跟风开了一个。鸡年是新的开始，希望自己和家人能百尺竿头更进一步，希望自己能开拓一些眼界，不局限于技术这个圈子，触类旁通，博采众长","text":"本人是魔都的一名攻城狮，浑浑噩噩工作了有八年时间，写了很多代码，但好像没有觉得多有成就感，反而觉得这不是追求所在，很喜欢研究传统文化、股票投资，工作之余自得其乐，现在流行自建博客，也跟风开了一个。鸡年是新的开始，希望自己和家人能百尺竿头更进一步，希望自己能开拓一些眼界，不局限于技术这个圈子，触类旁通，博采众长","categories":[{"name":"daily","slug":"daily","permalink":"https://www.easonx.cn/categories/daily/"}],"tags":[{"name":"鸡年","slug":"鸡年","permalink":"https://www.easonx.cn/tags/%E9%B8%A1%E5%B9%B4/"}]}],"categories":[{"name":"daily","slug":"daily","permalink":"https://www.easonx.cn/categories/daily/"},{"name":"tradition","slug":"tradition","permalink":"https://www.easonx.cn/categories/tradition/"},{"name":"invest","slug":"invest","permalink":"https://www.easonx.cn/categories/invest/"},{"name":"travel","slug":"travel","permalink":"https://www.easonx.cn/categories/travel/"}],"tags":[{"name":"富荟广场","slug":"富荟广场","permalink":"https://www.easonx.cn/tags/%E5%AF%8C%E8%8D%9F%E5%B9%BF%E5%9C%BA/"},{"name":"西部世界","slug":"西部世界","permalink":"https://www.easonx.cn/tags/%E8%A5%BF%E9%83%A8%E4%B8%96%E7%95%8C/"},{"name":"餐厅","slug":"餐厅","permalink":"https://www.easonx.cn/tags/%E9%A4%90%E5%8E%85/"},{"name":"烧烤","slug":"烧烤","permalink":"https://www.easonx.cn/tags/%E7%83%A7%E7%83%A4/"},{"name":"佛法","slug":"佛法","permalink":"https://www.easonx.cn/tags/%E4%BD%9B%E6%B3%95/"},{"name":"止禅","slug":"止禅","permalink":"https://www.easonx.cn/tags/%E6%AD%A2%E7%A6%85/"},{"name":"阿毗达摩","slug":"阿毗达摩","permalink":"https://www.easonx.cn/tags/%E9%98%BF%E6%AF%97%E8%BE%BE%E6%91%A9/"},{"name":"禅定","slug":"禅定","permalink":"https://www.easonx.cn/tags/%E7%A6%85%E5%AE%9A/"},{"name":"慈心","slug":"慈心","permalink":"https://www.easonx.cn/tags/%E6%85%88%E5%BF%83/"},{"name":"功德","slug":"功德","permalink":"https://www.easonx.cn/tags/%E5%8A%9F%E5%BE%B7/"},{"name":"慈心观","slug":"慈心观","permalink":"https://www.easonx.cn/tags/%E6%85%88%E5%BF%83%E8%A7%82/"},{"name":"训练","slug":"训练","permalink":"https://www.easonx.cn/tags/%E8%AE%AD%E7%BB%83/"},{"name":"投资","slug":"投资","permalink":"https://www.easonx.cn/tags/%E6%8A%95%E8%B5%84/"},{"name":"股票","slug":"股票","permalink":"https://www.easonx.cn/tags/%E8%82%A1%E7%A5%A8/"},{"name":"旅游","slug":"旅游","permalink":"https://www.easonx.cn/tags/%E6%97%85%E6%B8%B8/"},{"name":"日本","slug":"日本","permalink":"https://www.easonx.cn/tags/%E6%97%A5%E6%9C%AC/"},{"name":"关西","slug":"关西","permalink":"https://www.easonx.cn/tags/%E5%85%B3%E8%A5%BF/"},{"name":"奈良","slug":"奈良","permalink":"https://www.easonx.cn/tags/%E5%A5%88%E8%89%AF/"},{"name":"京都","slug":"京都","permalink":"https://www.easonx.cn/tags/%E4%BA%AC%E9%83%BD/"},{"name":"大阪","slug":"大阪","permalink":"https://www.easonx.cn/tags/%E5%A4%A7%E9%98%AA/"},{"name":"顿悟","slug":"顿悟","permalink":"https://www.easonx.cn/tags/%E9%A1%BF%E6%82%9F/"},{"name":"禅修","slug":"禅修","permalink":"https://www.easonx.cn/tags/%E7%A6%85%E4%BF%AE/"},{"name":"静坐","slug":"静坐","permalink":"https://www.easonx.cn/tags/%E9%9D%99%E5%9D%90/"},{"name":"道教","slug":"道教","permalink":"https://www.easonx.cn/tags/%E9%81%93%E6%95%99/"},{"name":"鸡年","slug":"鸡年","permalink":"https://www.easonx.cn/tags/%E9%B8%A1%E5%B9%B4/"}]}